Repository: gmadala/DP
Catalog: translations/*.po
Languages: es

source: Added
es: Agregado

source: Average Bookout
es: Cierre promedio

source: Back To Payments
es: Regresar a Pagos

source: Back To Title Releases
es: Regresar a Liberaciones de títulos

source: Credit and Payments
es: Crédito y Pagos

source: Fill out for Kelley Blue Book<sup>®</sup>Auction Values
es: Llenar Valores de subasta del Libro Kelley Blue<sup>®</sup>

source: Floored on
es: En el piso

source: Hide
es: Ocultar

source: Highest average bookout <br /> less than purchase price
es: Mayor cierre promedio <br /> menor que el precio de compra

source: How would you rate your experience with flooring online?
es: ¿Cómo califica su experiencia con las operaciones de piso en línea?

source: MMR Value Vehicle Style
es: Estilo de vehículo con valor MMR

source: Only purchase price data <br /> is available
es: Solo los datos de precio de compra <br /> están disponibles

source: Pay me
es: Pagarme

source: Pay someone else
es: Pagar a otra persona

source: Please enter a valid purchase date (mm/dd/yyyy).
es: Favor de ingresar una fecha de compra válida (mm/dd/aaaa)

source: Please enter a value less than $400,000.
es: Favor de ingresar una fecha de compra válida (mm/dd/aaaa)

source: Please enter the purchase amount.
es: Favor de ingresar el monto de compra

source: Print FedEx Label
es: Favor de ingresar el monto de compra

source: Print Request Summary
es: Favor de ingresar el monto de compra

source: Purchase Date (mm/dd/yyyy)
es: Fecha de compra (mm/dd/aaaa)

source: Purchase price less than <br /> highest average bookout
es: Precio de compra menor que <br /> mayor cierre promedio

source: Purchase price more than <br /> highest average bookout
es: Precio de compra superior a <br /> mayor cierre promedio

source: Show
es: Mostrar

source: Stock Number:
es: Número de inventario:

source: submit
es: Enviar

source: Survey comment is required.
es: Comentario de encuesta obligatorio

source: Tell us more!
es: ¡Cuéntenos más!

source: Thank you for the feedback!
es: ¡Gracias por sus comentarios!

source: Thank you for your floor plan request.
es: Gracias por solicitar el plan de piso

source: Thank you for your payment submission.
es: Gracias por enviar su pago

source: The purchase amount is more than your available credit.
es: El monto de compra es superior a su crédito disponible

source: Title Released on
es: Título liberado el

source: Vehicle Value Comparison
es: Comparación de valores de vehículos

source: We are sorry, but we do not recognize this VIN. If your VIN was entered correctly, you can still submit your request.
es: Lo sentimos, pero no reconocemos este NIV. Si su NIV fue ingresado correctamente, aún puede enviar su solicitud

source: We were unable to pull one or more bookout values from our partner.
es: No pudimos extraer uno o más valores de cierre de nuestro socio

source: We're sorry, the highlighted title(s) listed above cannot be processed at this time. Please call Customer Service at
es: Lo sentimos, el (los) título(s) resaltado(s) que se enumeran anteriormente no pueden procesarse en este momento. Favor de llamar a Servicio al Cliente al

source: Who do you want to pay?
es: ¿A quién desea pagarle?

source: You will receive an email confirmation shortly at
es: En breve recibirá una confirmación por correo electrónico en
