Repository: gmadala/DP
Catalog: po/*.po
Languages: es, fr_ca

source: Posted Date
es: Fecha de publicación
fr_ca: Date de publication

source: Previous Disbursements
es: Desembolsos anteriores
fr_ca: Décaissements précédents

source: Principal
fr_ca: Capital

source: Print FedEx Label
fr_ca: Imprimer l'étiquette FedEx

source: Print Request Summary
fr_ca: Imprimer la demande de résumé

source: Privacy Statement
es: Declaración de privacidad
fr_ca: Déclaration de confidentialité

source: Proceed to Step 2
es: Proceda al Paso 2
fr_ca: Passez à l'étape 2.

source: Processed
es: Procesado
fr_ca: Traité

source: Processing...
es: Procesando...
fr_ca: En traitement...

source: Product Type
es: Tipo de producto
fr_ca: Type de produit

source: Profile Settings
es: Ajustes del perfil
fr_ca: Paramètres du profil

source: Promo
es: Promoción
fr_ca: Promotion

source: Promos
es: Promociones
fr_ca: Promotions

source: Promotions / Event Sales
es: Promociones / Eventos de Venta
fr_ca: Promotions/activités de vente

source: Purchase Amount
es: Importe de la compra
fr_ca: Montant de l'achat

source: Purchase Date
es: Fecha de la compra
fr_ca: Date d'achat

source: Purchase Date (mm/dd/yyyy)
fr_ca: Date d'achat (jj/mm/aaaa)

source: Purchase Information:
fr_ca: Informations sur l'achat :

source: Purchase price less than <br /> highest average bookout
fr_ca: Le prix d'achat est inférieur <br />ŕ la valeur aux livres moyenne <br />la plus élevée

source: Purchase price more than <br /> highest average bookout
fr_ca: Le prix d'achat est supérieur <br />ŕ la valeur aux livres moyenne <br />la plus élevée

source: Purchased
es: Comprado
fr_ca: Acheté

source: Purchased For
es: Comprado para
fr_ca: Acheté pour

source: Purchased:
es: Comprado:
fr_ca: Acheté :

source: Range of Stock #'s
es: Rango de números de inventario:
fr_ca: Plage de numéros de stock

source: Receipt #, Stock #, VIN, Check #, Make, Model or Year
es: # de recibo, # de inventario, # de cheque, marca, modelo o año
fr_ca: No de reçu, no de stock, no de vérification, marque, modèle ou année

source: Receipt Date
es: Fecha de recibo
fr_ca: Date du reçu

source: Receipt No.
es: Recibo Núm.
fr_ca: No de reçu

source: Receipt Options
es: Opciones de recibos
fr_ca: Options liées aux reçus

source: Receipt Search
es: Búsqueda de recibos
fr_ca: Recherche de reçu

source: Receipt Total
es: Total del recibo
fr_ca: Total du reçu

source: Receipts
es: Recibos
fr_ca: Reçus

source: Receipts formatting options
es: Opciones para el formato de recibos
fr_ca: Options de format des reçus

source: Receipts Selected
es: Recibos seleccionados
fr_ca: Reçus sélectionnés

source: Receivable Detail (PDF)
es: Detalle de cuentas por cobrar (PDF)
fr_ca: Détails de la créance (PDF)

source: Recent Disbursements
es: Desembolsos recientes
fr_ca: Décaissements récents

source: Recent Receipts
es: Recibos recientes
fr_ca: Reçus récents

source: Recently Floored Vehicles
es: Vehículos financiados recientemente
fr_ca: Véhicules récemment financé

source: Records Services Charge
es: Cargo por servicios de registro
fr_ca: Frais de services de dossiers

source: Release Status
es: Estado de la liberación
fr_ca: État d'émission

source: Released
es: Liberado
fr_ca: Émis

source: Remaining Payment Balance
es: Saldo remanente
fr_ca: Solde à payer

source: Remember Username
es: Recuerde el nombre del usuario
fr_ca: Se souvenir du nom d'usager

source: Remove
es: Eliminar
fr_ca: Retirer

source: Remove Receipt
es: Eliminar recibo
fr_ca: Enlever le reçu

source: Remove Title
es: Eliminar título
fr_ca: Retirer le certificat d'immatriculation

source: Reports
es: Reportes
fr_ca: Rapports

source: Request a Credit Increase
es: Solicitar un aumento de crédito
fr_ca: Demander une augmentation de crédit

source: Request an extension?
es: ¿Desea solicitar una ampliación?
fr_ca: Demander une prolongation?

source: Request Credit Increase
es: Solicitar aumento de crédito
fr_ca: Demander une augmentation de crédit

source: Request Extension
es: Solicitar ampliación
fr_ca: Demander une prolongation

source: Request Payout
es: Solicitar pago
fr_ca: Demander un paiement

source: Request submitted
es: Solicitud enviada
fr_ca: Demande soumise

source: Request the Title
es: Solicitar el título
fr_ca: Requérir le certificat d'immatriculation

source: Request Title
es: Solicitar título
fr_ca: Demander un enregistrement

source: Request Unapplied Funds Payout
es: Solicitar pago de fondos no aplicados
fr_ca: Demander un paiement de fonds non alloués

source: Request<br>Extension
es: Solicitar<br>ampliación
fr_ca: Demander une<br>prolongation

source: Requests Summary
es: Resumen de solicitudes
fr_ca: Sommaire des demandes

source: required
es: obligatorio
fr_ca: requis

source: Required document types include:
fr_ca: Les types de documents requis comprennent :

source: Reserve Funds
es: Fondos de reserva
fr_ca: Fonds de réserve

source: Resolve via
fr_ca: Régler par

source: Resources
es: Recursos
fr_ca: Ressources

source: Return to Form
es: Volver al formato
fr_ca: Retourner au formulaire

source: Review and Floor Vehicle
es: Revisión y vehículo en piso
fr_ca: Compte rendu et véhicule en nantissement

source: Review Request
fr_ca: Réviser la demande

source: Review the following and submit your title release requests.
es: Revise lo siguiente y envíe sus solicitudes de liberación de título.
fr_ca: Révisez ce qui suit et soumettez vos demandes d'émission de certificat d'immatriculation.

source: Rough
es: Aproximado
fr_ca: Décharné

source: Routing Number
es: Número de enrutamiento
fr_ca: Numéro d'acheminement

source: Routing number must have 9 digits.
es: El número de enrutamiento debe tener 9 dígitos.
fr_ca: Le numéro d'acheminement ne doit contenir que 9 chiffres.

source: Sale Date
es: Fecha de venta
fr_ca: Date de vente

source: Sale Details
fr_ca: Informations sur la vente

source: Sale Information
es: Información de venta
fr_ca: Informations de vente

source: Sale Type
es: Tipo de venta
fr_ca: Type de vente

source: Sales Date
es: Fecha de venta
fr_ca: Date de vente

source: Salvage
es: Recuperación
fr_ca: VGA

source: Save
es: Guardar
fr_ca: Sauvegarder

source: Save Changes
es: Guardar los cambios
fr_ca: Sauvegarder les modifications

source: Save Settings
es: Guarde los ajustes
fr_ca: Sauvegarder les paramètres

source: Savings Per Purchase
es: Ahorros por compra
fr_ca: Économies par achat

source: Schedule Date
es: Fecha programada
fr_ca: Programmer une date

source: Scheduled
es: Programado
fr_ca: Programmé

source: Scheduled Payments
es: Pagos programados
fr_ca: Paiements programmés

source: Search
es: Búsqueda
fr_ca: Recherche

source: Search by Dealer's NextGear Capital Business Number, Business Name, AuctionACCESS number, or External Buyer ID.
es: Búsqueda por número/nombre comercial de distribuidor de NextGear Capital, número AuctionACCESS o identificación de comprador externo
fr_ca: Rechercher par numéro d'entreprise de concessionnaire NextGear Capital, nom d'entreprise, numéro AuctionACCESS ou ID d'acheteur externe.

source: Search for a VIN to import vehicle details &amp; style
fr_ca: Rechercher un NIV pour importer les informations et le style du véhicule

source: Security Question {{$index + 1}}
es: Pregunta de seguridad {{$index + 1}}
fr_ca: Question de sécurité {{$index+1}}

source: Security Question #{{$index+1}}
es: Pregunta de seguridad #{{$index+1}}
fr_ca: Question de sécurité No{{$index+1}}

source: Security Question Answers
es: Respuestas a las preguntas de seguridad
fr_ca: Réponses à la question de sécurité

source: See Details
es: Ver detalles
fr_ca: Consulter les détails

source: Select a business below.
es: A continuación seleccione un negocio.
fr_ca: Sélectionner un affaires ci-dessous

source: Select a business name below to query the account.
es: A continuación seleccione un nombre de negocio para consultar la cuenta.
fr_ca: Sélectionner ci-dessous un nom d'entreprise pour consulter le compte

source: Select a date from the picker below
es: Seleccione una fecha en el siguiente seleccionador
fr_ca: Sélectionnez une date à partir du sélecteur ci-dessous

source: Select a payment from the options below
es: Seleccione un pago entre las opciones siguientes
fr_ca: Sélectionnez un paiement parmi les options ci-dessous

source: Select Below
es: Seleccione abajo
fr_ca: Sélectionner ci-dessous

source: Select Manual Lookup Values
es: Seleccione los valores manuales para la búsqueda
fr_ca: Sélectionnez les valeurs de recherche manuelle

source: Select the payments you want to make or schedule by adding them to your payment queue.
es: Para seleccionar los pagos que desee hacer o programar, agréguelos a su lista de pagos.
fr_ca: Sélectionnez les paiements que vous souhaitez effectuer ou programmer en les ajoutant à vos paiements en attente.

source: Select the Schedule Date
es: Seleccione la fecha programada.
fr_ca: Sélectionner la date programmée

source: Seller
es: Vendedor
fr_ca: Vendeur

source: Seller Address
es: Dirección del vendedor
fr_ca: Adresse du vendeur

source: Seller:
es: Vendedor:
fr_ca: Vendeur :

source: Send Payment To
es: Enviar pago a
fr_ca: Envoyer le paiement à

source: Send Title to a Different Address?
es: ¿Enviar título a un domicilio diferente?
fr_ca: Envoyer le certificat d'immatriculation à une adresse différente?

source: Send To
es: Enviar a
fr_ca: Envoyer à

source: Settings
es: Ajustes
fr_ca: Paramètres

source: Show
fr_ca: Afficher

source: Show Old Promos
es: Mostrar promociones antiguas
fr_ca: Afficher les anciennes promotions

source: Show Payment Activity
es: Ver actividad de pago
fr_ca: Afficher l'activité de paiement

source: Show Payment Details
es: Ver detalles de pago
fr_ca: Afficher les informations sur le paiement

source: Sign Out
es: Salir
fr_ca: Fermeture de session

source: Since this is your first login to myNextGear, please set your security questions before you enter the site.
es: Ya que ésta es su primera visita a myNextGear, por favor establezca sus preguntas de seguridad antes de entrar al sitio.
fr_ca: Comme il s'agit de votre première ouverture de session auprès de MyNextGear, veuillez créer vos questions de sécurité avant d'accéder au site.

source: Some title request(s) can not be processed at this time.
es: Algunas solicitudes de títulos no pueden procesarse en este momento.
fr_ca: Certaines demandes de certificat d'immatriculation ne peuvent être traitées en ce moment.

source: Sorry, but the page you were trying to view does not exist.
es: Lo sentimos, la página que está tratando de ver no existe.
fr_ca: Désolé, la page que vous essayez d'afficher n'existe pas.

source: Sorry, no results found.
es: Lo sentimos, no encontramos ningún resultado.
fr_ca: Désolé, aucun résultat n'a été trouvé.

source: Sorry, no results found. Please <a ng-click="payments.resetSearch()" title="New Search">try a new search</a>.
es: Lo sentimos, no encontramos ningún resultado. Por favor, <a ng-click="payments.resetSearch()" title="Nueva búsqueda">realice una nueva búsqueda</a>.
fr_ca: Désolé, aucun résultat n'a été trouvé. Veuillez <a ng-click="payments.resetSearch()" title="New Search">tenter une nouvelle recherche</a>.

source: Sorry, no results found. Please <a ng-click="receipts.resetSearch()" title="New Search">try a new search</a>.
es: Lo sentimos, no encontramos ningún resultado. Por favor, <a ng-click="receipts.resetSearch()" title="Nueva búsqueda">realice una nueva búsqueda</a>.
fr_ca: Désolé, aucun résultat n'a été trouvé. Veuillez <a ng-click="receipts.resetSearch()" title="New Search">tenter une nouvelle recherche</a>.

source: Sorry, no results found. Please <a ng-click="resetSearch()" title="New Search">try a new search</a>.
es: Lo sentimos, no encontramos ningún resultado. Por favor, <a ng-click="resetSearch()" title="Nueva búsqueda">realice una nueva búsqueda</a>.
fr_ca: Désolé, aucun résultat n'a été trouvé. Veuillez <a ng-click="resetSearch()" title="New Search">tenter une nouvelle recherche</a>.

source: Sorry, no results found. Please <a ng-click="resetSellerSearch()" title="New Search">try a new search</a>.
es: Disculpe, no encontramos ningún resultado. Por favor, <a ng-click="resetSellerSearch()"title="New Search">haga una nueva búsqueda</a>.
fr_ca: Désolé, aucun résultat n'a été trouvé. Veuillez tenter une nouvelle recherche.

source: Sorry, no results found. Please try a new search query.
es: Disculpe, no encontramos ningún resultado, Por favor, consulte de nuevo.
fr_ca: Désolé, aucun résultat n'a été trouvé. Veuillez tenter une nouvelle requête de recherche.

source: Sorry, no results found. Please try a new search.
es: Lo sentimos, no encontramos ningún resultado. Por favor, realice una nueva búsqueda.
fr_ca: Désolé, aucun résultat n'a été trouvé. Veuillez tenter une nouvelle recherche.

source: Sort By
es: Clasificado por
fr_ca: Trier par

source: Specific Stock #'s
es: Números específicos de inventario
fr_ca: No de stock particulier

source: Stale and Aging Vehicles
es: Vehículos averiados y viejos
fr_ca: Véhicules Périmés et Vieillissants

source: Start Date
es: Fecha de inicio
fr_ca: Date de début

source: Start Date should not be later than End Date.
es: La fecha de inicio no debe ser posterior a la fecha de terminación.
fr_ca: La date de début doit être antérieure à la date de fin.

source: State
es: Estado
fr_ca: Province

source: Status
es: Estatus
fr_ca: État

source: Status:
es: Estatus:
fr_ca: État :

source: Step 1 of 2: Add Your Account
es: Paso 1 de 2: Agregue su cuenta
fr_ca: Étape 1 de 2 : ajouter votre compte

source: Step 2 of 2: Designated Account Change Request and Consent
es: Paso 2 de 2: Petición y autorización de cambio de cuenta designada
fr_ca: Étape 2 de 2 : demande de changement de compte désigné et consentement

source: Stock #
es: Inventario #
fr_ca: No de stock

source: Stock # Range End
es: Fin del rango de números de inventario:
fr_ca: Fin de la plage de no de stock

source: Stock # Range Start
es: Inicio del rango de números de inventario:
fr_ca: Début de de la plage de no de stock

source: Stock #, VIN, Make, Model, or Year
es: # de inventario, VIN, marca, modelo o año
fr_ca: No de stock, NIV, marque, modèle ou année

source: Stock No.
es: Núm. de inventario
fr_ca: No de stock

source: Stock Number
es: Número de inventario
fr_ca: Numéro de stock

source: Stock Number Filter (optional)
es: Filtro de número de inventario (opcional)
fr_ca: Filtrer par numéro de stock (facultatif)

source: Stock Number:
fr_ca: Numéro de stock:

source: Style *
es: Estilo:
fr_ca: Modèle *

source: Submit
es: Enviar
fr_ca: Soumettre

source: Submit Flooring Request
es: Enviar solicitud de puesta en piso
fr_ca: Soumettre une demande de financement

source: Submit Payments
es: Enviar pagos
fr_ca: Soumettre des paiements

source: Submit Requests
es: Enviar solicitudes
fr_ca: Soumettre des demandes

source: Submitting an interest only payment will not advance the due date.
es: Enviar un pago único de interés no adelantará la fecha de vencimiento.
fr_ca: Le seul paiement de l'intérêt ne permettra pas de devancer l'échéance.

source: Subsidiary Manufacturer
es: Subsidiaria fabricante
fr_ca: Filiale du fabricant

source: Subtotal
fr_ca: Sous-total

source: Success
es: Éxito
fr_ca: Succès

source: Supported formats: image, word, excel and pdf. 5MB max per file.
es: Formatos compatibles: imagen, word, excel y pdf. 5 MB máx. por archivo.
fr_ca: Formats reconnus : image, Word, Excel et PDF (maximum de 5 Mo par fichier).

source: Supported Formats: Image, Word, Excel, and PDF
fr_ca: Formats reconnus : image, Word, Excel et PDF

source: Survey comment is required.
fr_ca: Un commentaire sur le sondage est requis.

source: Technical Support
es: Soporte Técnico
fr_ca: Soutien technique

source: Tell us about the vehicle you would like to floor
fr_ca: Décrivez-nous le véhicule que vous aimeriez financer

source: Tell us more!
fr_ca: Dites-nous ce que vous en pensez!

source: Term Plan Name
es: Nombre del plan de plazos
fr_ca: Nom du plan à terme

source: Thank you for the feedback!
fr_ca: Nous vous remercions pour votre commentaire!

source: Thank you for your floor plan request.
fr_ca: Nous vous remercions pour votre demande de plan de nantissement.

source: Thank you for your payment submission.
fr_ca: Merci de nous avoir fait parvenir votre paiement.

source: Thank you, check your email for the requested account information.
es: Gracias, consulte su correo electrónico para ver la información de la cuenta solicitada.
fr_ca: Merci; veuillez consulter vos courriels pour l'information demandée sur le compte.

source: The floor plan you have selected for title release would put you over the financial plan limits for this account.
es: El plan de piso que seleccionó para la liberación de títulos lo colocaría por encima de los límites del plan financiero de esta cuenta.
fr_ca: Le plan de financement que vous avez sélectionné pour l'émission du certificat d'immatriculation vous portera au-delà des limites du plan financier de ce compte.

source: The following values are based on the Zip provided.
es: Los siguientes valores se basan en el archive Zip proporcionado.
fr_ca: Les valeurs ci-dessous sont basées sur le code postal américain que vous avez fourni.

source: The following values represent a national average.
es: Los siguientes valores representan un promedio nacional.
fr_ca: Les valeurs ci-dessous représentent une moyenne nationale.

source: The new menu is redesigned so all of your selections are available in one place.
fr_ca: Le nouveau menu a été repensé de façon à ce que toutes vos sélections puissent être disponibles à un seul endroit.

source: The passwords do not match. Please re-enter the password.
es: Las contraseñas no coinciden, por favor, capture la contraseña de nuevo.
fr_ca: Les mots de passe ne correspondent pas. Veuillez entrer le mot de passe à nouveau.

source: The purchase amount is more than your available credit.
fr_ca: Le montant de l'achat est supérieur ŕ votre crédit disponible.

source: The specific information required to determine the value for this particular vehicle was supplied by the person generating this report. Vehicle valuations are opinions and may vary from vehicle to vehicle. Actual valuations will vary based upon market conditions, specifications, vehicle condition or other particular circumstances pertinent to this particular vehicle or the transaction or the parties to the transaction. This report is intended for the individual use of the person generating this report only and shall not be sold or transmitted to another party. Kelley Blue Book assumes no responsibility for errors or omissions.
es: Las tasaciones de los vehículos son opiniones y pueden variar según el vehículo. Las tasaciones reales variarán según las condiciones del mercado, las especificaciones, el estado del vehículo u otras circunstancias particulares en relación con este vehículo o la transacción o las partes involucradas. Kelley Blue Book no asume ninguna responsabilidad por errores u omisiones. (v.14051)
fr_ca: L'information exacte requise pour déterminer la valeur de ce véhicule en particulier a été fournie par la personne qui produit ce rapport. La valeurs des véhicules ne sont que des opinions et peuvent varier d'un véhicule à l'autre. La valeurs réelles varient en fonction de l'évolution du marché, des caractéristiques et de la condition du véhicule ou de toute autre circonstance exceptionnelle liée à ce véhicule en particulier ou à la transaction ou aux parties effectuant la transaction. Ce rapport est destiné uniquement à une utilisation individuelle par la personne produisant ce rapport et ne doit ni être vendu, ni être transmis à un tiers. Kelley Blue Book n'assume aucune responsabilité en cas d'erreurs ou d'omissions.

source: The title(s) will be sent to the following address: <strong>{{addresses[0] | address}}</strong>
es: El (los) título(s) se enviarán a la siguiente dirección: <strong> {{addresses[0] | address}}</strong>
fr_ca: Les certificats d'immatriculation seront envoyés à l'adresse suivante : <strong>{{addresses[0] | address}}</strong>

source: There are multiple vehicle styles for this VIN. Please select the appropriate style below.
es: Hay múltiples estilos de vehículos que corresponden a este VIN. Por favor, seleccione el estilo adecuado a continuación.
fr_ca: Il y a plusieurs styles de véhicules pour ce NIV. Veuillez sélectionner le style approprié ci-dessous.

source: There are too many results to display, please refine your search further.
es: Hay demasiados resultados para poder mostrarlos; por favor, delimite su búsqueda.
fr_ca: Il y a trop de résultats à afficher; veuillez préciser votre recherche.

source: There was a problem uploading your documents. Please email them to NextGear Capital.
es: Hubo un problema al cargar sus documentos. Por favor envíelos por correo electrónico a NextGear Capital.
fr_ca: Un problème est survenu lors du téléchargement de vos documents. Veuillez les envoyer par courriel à NextGear Capital.

source: There was a problem with your flooring request. Please contact NextGear Capital.
es: Hubo un problema con su solicitud de puesta en piso. Por favor póngase en contacto con NextGear Capital.
fr_ca: Un problème est survenu avec votre demande de nantissement. Veuillez communiquer avec NextGear Capital.

source: This {{ paymentType }} cannot be scheduled
es: Este {{ paymentType }} no puede programarse.
fr_ca: Ce {{ paymentType }} ne peut être programmé

source: This account will be used for all system-generated deposits, including automatic payout of unapplied funds.
es: Esta cuenta se utilizará para todos los depósitos generados por el sistema, incluido el importe del pago automático de los fondos no aplicados.
fr_ca: Ce compte sera utilisé pour tous les dépôts générés par le système, y compris les versements automatiques de fonds non alloués.

source: This account will be used for all system-generated payments. When making or scheduling payments online, you can select any active account.
es: Esta cuenta se utilizará para todos los pagos generados por el sistema. Cuando haga o programe pagos en línea, puede seleccionar cualquier cuenta activa.
fr_ca: Ce compte sera utilisé pour tous les paiements générés par le système. Lorsque vous effectuez ou programmez un paiement en ligne, vous pouvez sélectionner n'importe quel compte actif.

source: This extension request cannot be completed online.
es: Esta solicitud de ampliación no puede llenarse en línea.
fr_ca: Cette demande de prolongation ne peut être complétée en ligne.

source: This is not a passenger vehicle, and I'd like to manually enter the details:
fr_ca: Il ne s'agit pas d'un véhicule de promenade et je souhaite entrer les informations manuellement :

source: This line has a temporary credit increase of {{ dashboardData.selectedLineOfCredit.TempLineOfCreditAmount | numeral:'$0,0.00' }} that expires on {{dashboardData.selectedLineOfCredit.TempLineOfCreditExpiration | moment}}.
es: Esta línea de crédito tiene un incremento temporal de {{dashboardData.selectedLineOfCredit.TempLineOfCreditAmount | numeral:'$0,0.00' }} que vence el {{dashboardData.selectedLineOfCredit.TempLineOfCreditExpiration | moment}}.
fr_ca: Cette marge de crédit dispose d'une augmentation de crédit temporaire au montant de {{ dashboardData.selectedLineOfCredit.TempLineOfCreditAmount | numeral:'$0,0.00' }} qui arrive à échéance le {{dashboardData.selectedLineOfCredit.TempLineOfCreditExpiration | moment}}.

source: This month
es: Este mes
fr_ca: Ce mois
