Repository: gmadala/DP
Catalog: po/*.po
Languages: es, fr_ca

source: -- Select a Question --
es: -- Seleccione una pregunta --
fr_ca: -- Sélectionner une question --

source: -- Select Bank --
es: -- Seleccione un banco --
fr_ca: --Sélectionner la banque --

source: – This request will be submitted for review and may require additional information. Please contact your NextGear Capital Representative with any questions.
es: – Esta solicitud se enviará para su revisión y puede requerir información adicional. Por favor, póngase en contacto con su representante de NextGear Capital si tiene alguna pregunta.
fr_ca: – Cette demande sera révisée et peut nécessiter des renseignements supplémentaires. Veuillez communiquer avec votre représentant NextGear Capital pour toute question que vous pourriez avoir.

source: (Ex. Additional instructions, etc.)
fr_ca: (P. ex., instructions supplémentaires, etc.)

source: {{ flooringInfo.ExtendedTermDaysFloored }} <span class="value-note">(of {{ flooringInfo.ExtendedTermPlanLength }} days)</span>
es: {{ flooringInfo.ExtendedTermDaysFloored }} <span class="value-note">(of {{ flooringInfo.ExtendedTermPlanLength }} días)</span>
fr_ca: {{ flooringInfo.ExtendedTermDaysFloored }} <span class="value-note">(de {{ flooringInfo.ExtendedTermPlanLength }} jours)</span>

source: {{ flooringInfo.OriginalTermDaysFloored }} <span class="value-note">(of {{ flooringInfo.OriginalTermPlanLength }} days)</span>
es: {{ flooringInfo.OriginalTermDaysFloored }} <span class="value-note">(of {{ flooringInfo.OriginalTermPlanLength }} días)</span>
fr_ca: {{ flooringInfo.OriginalTermDaysFloored }} <span class="value-note">(de {{ flooringInfo.OriginalTermPlanLength }} jours)</span>

source: {{ flooringInfo.TotalDaysFloored }} <span class="value-note">(of {{ flooringInfo.TotalTermPlanLength }} days)</span>
es: {{ flooringInfo.TotalDaysFloored }} <span class="value-note">(of {{ flooringInfo.TotalTermPlanLength }} días)</span>
fr_ca: {{ flooringInfo.TotalDaysFloored }} <span class="value-note">(de {{ flooringInfo.TotalTermPlanLength }} jours)</span>

source: {{ item.DaysFloored }} days
es: {{ item.DaysFloored }} días
fr_ca: {{ item.DaysFloored }} jours

source: {{ item.DaysOnFloorplan }} days
es: {{ item.DaysOnFloorplan }} días
fr_ca: {{ item.DaysOnFloorplan }} jours

source: {{ paymentQueue.sum.scheduledCount() }} Future Payment
es: {{ paymentQueue.sum.scheduledCount() }} Pago Futuro
fr_ca: {{ paymentQueue.sum.scheduledCount() }} Paiement futur

source: {{ results.mileage | numeral:'0,0' }} miles
es: {{ results.mileage | numeral:'0,0' }} millas
fr_ca: {{ results.mileage | numeral:'0,0' }} milles

source: # of Cars Purchased
es: # de automóviles comprados
fr_ca: Voitures achetées

source: # of Floored Vehicles
es: # de vehículos financiados
fr_ca: Véhicules mis en financement

source: # Purchased
es: # comprados
fr_ca: Achats

source: %START_DATE% - %END_DATE% Edition for zip code %ZIP_CODE%.
es: Todos los derechos reservados. Blue Book® es una marca comercial registrada de Kelley Blue Book Co., Inc.
fr_ca: Édition %START_DATE% - %END_DATE% pour code postal américain %ZIP_CODE%.

source: © %YEAR% By Kelley Blue Book Co., Inc.
es: © %YEAR% Kelley Blue Book Co., Inc.
fr_ca: © %YEAR% Par Kelley Blue Book Co., Inc.

source: <span class="count highlight dash-major" ng-bind="eligibility.RemainingReleasesAvailable - titleQueue.contents.length">0</span> out of <span class="count highlight dash-major" ng-bind="eligibility.TotalReleasesAllowed">0</span>
es: <span class="count highlight dash-major" ng-bind="eligibility.RemainingReleasesAvailable - titleQueue.contents.length">0</span> de <span class="count highlight dash major" ng-bind="eligibility.TotalReleasesAllowed">0</span>
fr_ca: <span class="count highlight dash-major" ng-bind="eligibility.RemainingReleasesAvailable - titleQueue.contents.length">0</span> sur <span class="count highlight dash-major" ng-bind="eligibility.TotalReleasesAllowed">0</span>

source: <strong>0</strong> Days
es: <strong>0</strong> Días
fr_ca: <strong>0</strong> jours

source: <strong>1-24</strong> Days
es: <strong>1-24</strong> Días
fr_ca: <strong>1 à 24</strong> jours

source: <strong>100+</strong> Days
es: <strong>100+</strong> Días
fr_ca: <strong>100</strong> jours ou plus

source: <strong>25-49</strong> Days
es: <strong>25-49</strong> Días
fr_ca: <strong>25 à 49</strong> jours

source: <strong>50-74</strong> Days
es: <strong>50-74</strong> Días
fr_ca: <strong>50 à 74</strong> jours

source: <strong>75-99</strong> Days
es: <strong>75-99</strong> Días
fr_ca: <strong>75 à 99</strong> jours

source: <strong>Temporary</strong> – This request will be reviewed for a term up to 60 days.
es: <strong>Temporal</strong> - Esta solicitud se revisará en un plazo máximo de 60 días.
fr_ca: <strong>Temporaire</strong> – Cette demande sera révisée pour un terme allant jusqu'à 60 jours.

source: 1 VIN per page
es: 1 VIN por página
fr_ca: 1 NIV par page

source: 1. Vehicle Information
es: 1. Información de vehículos
fr_ca: 1. Informations sur le véhicule

source: 1. Which line of credit would you like to extend?
es: 1. ¿Qué línea de crédito desea ampliar?
fr_ca: 1. Quelle marge de crédit souhaitez-vous augmenter?

source: 2. Do you want this increase to be temporary or permanent?
es: 2. ¿Quiere que dicho aumento sea temporal o permanente?
fr_ca: 2. Voulez-vous que cette augmentation soit temporaire ou permanente?

source: 2. Sale Information
es: 2. Información de ventas
fr_ca: 2. Informations sur la vente

source: 3. Documents &amp; Instructions
es: 3. Documentos e Instrucciones
fr_ca: 3. Documents et directives

source: 3. How much would you like to increase it by?
es: 3. ¿De cuánto desea que sea el aumento?
fr_ca: 3. De combien souhaitez-vous l'augmenter?

source: 3. Optional Items
es: 3. Artículos opcionales
fr_ca: 3. Éléments facultatifs

source: a mistyped address
es: dirección mal escrita
fr_ca: une adresses mal tapée

source: A payment is due this week. <br><a class="primary" href="" ng-show="showExtendLink()" ng-click="requestExtension()">Request an extension?</a>
es: Hay un pago que se vence esta semana <br><a class="primary" href="" ng-show="showExtendLink()" ng-click="requestExtension()">¿Solicitar una extensión?</a>
fr_ca: Un paiement est dû cette semaine. <br><a class="primary" href="" ng-show="showExtendLink()" ng-click="requestExtension()">Demander une prolongation?</a>

source: A payment is due today. <br><a class="primary" href="" ng-show="showExtendLink()" ng-click="requestExtension()">Request an extension?</a>
es: Hay un pago que se vence hoy. <br><a class="primary" href="" ng-show=" showExtendLInk()" ng-click="requestExtension()">¿Solicitar una extensión?</a>
fr_ca: Un paiement est dû aujourd'hui. <br><a class="primary" href="" ng-show="showExtendLink()" ng-click="requestExtension()">Demander une prolongation?</a>

source: A payment is overdue. <br><a class="primary" href="" ng-show="showExtendLink()" ng-click="requestExtension()">Request an extension? </a>
es: Hay un pago vencido. <br><a class="primary" href="" ng-show="showExtendLInk()" ng-click="requestExtension()">¿Solicitar una extensión?</a>
fr_ca: Un paiement est en retard. <br><a class="primary" href="" ng-show="showExtendLink()" ng-click="requestExtension()">Demander une prolongation?</a>

source: Account
es: Cuenta
fr_ca: Compte

source: Account Fee
es: Cargo de la cuenta
fr_ca: Frais de compte

source: Account Management
es: Administración de Cuentas
fr_ca: Gestion de Compte

source: Account Number
es: Número de la cuenta
fr_ca: Numéro de compte

source: Account number must only have numbers.
es: El número de la cuenta solo debe contener números.
fr_ca: Le numéro de compte ne doit contenir que des chiffres.

source: Acknowledge VIN Look-Up Failure *
es: Falla en la búsqueda de reconocimiento de VIN *
fr_ca: Confirmer l'échec de recherche du NIV *

source: Active
es: Activa
fr_ca: Actif

source: Activity Date
es: Fecha de la actividad
fr_ca: Date de l'activité

source: Actual sale date must be used when flooring a car
es: Deberá utilizarse la fecha real de la venta cuando se ponga un automóvil en piso.
fr_ca: Plage des dates selon la date du financement OU de la date du déboursement.

source: Actual sales dates must be used when flooring a car. By entering a sale date of the car being floored the auction certifies the entered sale date for the car is true and correct.
es: Deben utilizarse las fechas reales de ventas al poner en piso algún vehículo. Al capturar una fecha de venta del automóvil que se está poniendo en piso, la subasta certifica que dicha fecha de venta del automóvil es precisa y correcta.
fr_ca: La date de vente actuelle doit être utilisée lors du financement d'un véhicule. En indiquant une date de vente pour le véhicule mis en financement, l'encanteur certifie que la date de vente indiquée pour ce véhicule est exacte et véridique.

source: Add
es: Agregar
fr_ca: Ajouter

source: Add Account
es: Agregar cuenta
fr_ca: Ajouter un compte

source: Add Additional Principal?
es: ¿Agregar capital adicional?
fr_ca: Ajoutez du capital supplémentaire?

source: Add Receipt
es: Agregar recibo
fr_ca: Ajouter un reçu

source: Added
fr_ca: Ajouté

source: Additional Addresses
es: Direcciones adicionales
fr_ca: Adresses supplémentaires

source: Additional Comments
fr_ca: Commentaires additionnels

source: Additional fees may apply. Please check your Rates and Fees schedule.
es: Puede haber cargos adicionales. Por favor, verifique su programa de tarifas y cargos.
fr_ca: Des frais supplémentaires peuvent s'appliquer. Veuillez vérifier votre tableau de taux et de frais.

source: Additional Principal
es: Capital adicional
fr_ca: Capital supplémentaire

source: ADDITIONAL PRINCIPAL
es: CAPITAL ADICIONAL
fr_ca: CAPITAL SUPPLÉMENTAIRE

source: Additional Principal Payment
es: Pago de capital adicional
fr_ca: Paiement de capital supplémentaire

source: Address
es: Dirección
fr_ca: Adresse

source: Address 1
es: Dirección 1
fr_ca: Adresse 1

source: Address 2
es: Dirección 2
fr_ca: Adresse 2

source: Address Settings
es: Configuración de dirección
fr_ca: Paramètres de l'adresse

source: All
es: Todos
fr_ca: Tous

source: All from your myNextGear account!
fr_ca: Tout sur votre compte myNextGear!

source: All Rights Reserved.
es: (Edición %START_DATE% - %END_DATE%). Código postal %ZIP_CODE%.
fr_ca: Tous droits réservés.

source: All values are displayed in Canadian Dollars unless specified.
es: Todos los valores se muestran en dólares canadienses salvo especificación en contrario.
fr_ca: À moins d'indication contraire, tous les montants sont affichés en dollars canadiens.

source: All values are displayed in US Dollars.
es: Todos los valores se muestran en dólares estadounidenses.
fr_ca: Tous les montants sont affichés en dollars américains.

source: Amount
es: Cantidad
fr_ca: Montant

source: Amount Outstanding is {{ businessSummary.DerivedAmountOutstanding | number:2 }}% of the NextGear Capital Book
es: La cantidad pendiente es {{ businessSummary.DerivedAmountOutstanding | number:2 }}% del Libro de NextGear Capital.
fr_ca: Le montant non réglé représente {{ businessSummary.DerivedAmountOutstanding | number:2 }} % de la valeur comptable de NextGear Capital

source: Amounts shown are valid through 8pm Eastern Time
es: Las cantidades que se muestran tienen validez hasta las 8 pm EST
fr_ca: Les montants indiqués sont valides jusqu'à 20 h, heure de l'Est

source: An email will be sent to you shortly with a tracking number.
es: Recibirá un correo electrónico muy pronto con un número de seguimiento.
fr_ca: Un courriel contenant un numéro de suivi vous sera envoyé sous peu.

source: an out-of-date link
es: vínculo fuera de fecha
fr_ca: un lien périmé

source: Analytics
es: Analítica
fr_ca: Analyses

source: And {{ title.data.extraAddresses }} additional addresses...
es: Y {{ title.data.extraAddresses }} direcciones adicionales...
fr_ca: Et {{ title.data.extraAddresses }} adresses additionnelles...

source: Answer
es: Respuesta
fr_ca: Réponse

source: Applicable Supporting Documents
fr_ca: Documents associés applicables

source: Apply these Funds to Payment?
es: ¿Aplicar estos fondos al pago?
fr_ca: Allouer ces fonds au paiement?

source: Approved
es: Aprobado
fr_ca: Approuvé

source: Approved Floor Plans
es: Planes de piso aprobados
fr_ca: Financements Approuvés

source: Approved/Not Paid
es: Aprobado/No pagado
fr_ca: Approuvé/Impayé

source: Approved/Paid
es: Aprobado/Pagado
fr_ca: Approuvé/payé

source: Are you sure you want to logout?
es: ¿Está seguro que desea salir?
fr_ca: Êtes-vous certain de vouloir terminer la session?

source: Auction Access No.
es: Núm. de acceso a la subasta
fr_ca: No. D'Auction Acces

source: Auction Access Number:
es: Número de acceso a la subasta:
fr_ca: No d'accès à l'encan :

source: Auction Access Number(s)
es: Número(s) de acceso a la subasta
fr_ca: Numéro(s) d'accès à l'encan

source: AuctionACCESS #
fr_ca: No AuctionACCESS

source: Audited
fr_ca: Vérifié

source: Audited:
fr_ca: Vérifié :

source: Authorization and Request to Unenroll
es: Autorización y solicitud para darse de baja
fr_ca: Autorisation et demande de désinscription

source: Auto-Disburse Unapplied Funds:
fr_ca: Fonds de paiement automatique non appliqué:

source: available
es: disponible
fr_ca: disponible

source: Available
es: Disponible
fr_ca: Disponible

source: Available Credit
es: Crédito disponible
fr_ca: Crédit disponible

source: Available Unapplied Funds
es: Fondos no aplicados disponibles
fr_ca: Fonds non alloués disponibles

source: available.
es: disponible.
fr_ca: disponible.

source: Average
es: Promedio
fr_ca: Moyen

source: Average # of Days to Turn
es: # promedio de días de rotación
fr_ca: Rotation Moyenne en nombre de jours

source: Average Bookout
fr_ca: Valeur moyenne aux livres

source: Average Purchase Price
es: Precio de compra promedio
fr_ca: Prix d'achat moyen

source: Average Turn
es: Turno promedio
fr_ca: Roulement moyen

source: Avg NextGear Capital Book Value
es: Valor promedio en libros de NextGear Capital
fr_ca: Valeur Comptable moyenne NextGear Capital

source: Avg Purchase Price
es: Precio de compra promedio
fr_ca: Prix d'achat moyen

source: Avg. # of Days to Turn
es: # promedio de días de rotación
fr_ca: Rotation moyenne en jours

source: Awaiting Disbursement
es: Esperando desembolso
fr_ca: Décaissements en attente

source: Awaiting Titles 0-15 Days
es: Títulos en espera de 0 - 15 días
fr_ca: Enregistrements en attente, 0 à 15 jours

source: Awaiting Titles 16-30 Days
es: Títulos en espera de 16 - 30 días
fr_ca: Enregistrements en attente, 16 à 30 jours

source: Awaiting Titles 30+ Days
es: Títulos en espera de más de 30 días
fr_ca: Enregistrements en attente, 30 jours ou plus

source: Back
fr_ca: Retour

source: Back of Title
es: Reverso del título
fr_ca: Verso du titre

source: Back To Payments
fr_ca: Retour aux paiements

source: Back To Title Releases
fr_ca: Retour ŕ l'émission des titres

source: Bank Account
es: Cuenta bancaria
fr_ca: Compte bancaire

source: Bank Account for Deposit (when applicable)
es: Cuenta bancaria para depósitos (en su caso)
fr_ca: Compte bancaire pour le dépôt (le cas échéant)

source: Bank Account for Payout
es: Cuenta bancaria para pago
fr_ca: Compte bancaire pour décaissement

source: Bank Name
es: Nombre del banco
fr_ca: Nom de la banque

source: Bank names are limited to 43 characters.
es: Los nombres de los bancos están limitados a 43 caracteres.
fr_ca: Les noms de banques doivent contenir un maximum de 43 caractères.

source: Before deactivating, select a different account below for your default deposits or payments.
es: Antes de proceder con la desactivación, seleccione a continuación una cuenta distinta para sus depósitos o pagos predeterminados.
fr_ca: Avant de désactiver, veuillez sélectionner un compte différent ci-dessous pour vos dépôts ou paiements par défaut.

source: Best and Worst Movers by Zipcode
es: Las de mejor y peor movimiento por código postal
fr_ca: Meilleurs et pires taux de roulement par code postal

source: Best Movers
es: Las de mejor movimiento
fr_ca: Meilleurs taux de roulement

source: Bill of Sale
es: Nota de venta
fr_ca: Contrat de vente

source: Business Email
es: Correo electrónico del negocio
fr_ca: Courriel de l'entreprise

source: Business Legal Name
es: Razón social
fr_ca: Dénomination sociale de l'entreprise

source: Business Name
es: Nombre del negocio
fr_ca: Nom de l'entreprise

source: Business Name or Number
es: Nombre o número del negocio
fr_ca: Nom ou numéro d'identification de l'entreprise

source: Business No.
es: Núm. de negocio
fr_ca: No de l'entreprise

source: Business Number
es: Número del negocio
fr_ca: Numéro d'entreprise

source: Business Number:
es: Número del negocio:
fr_ca: Numéro d'entreprise :

source: Business Search
es: Búsqueda del negocio
fr_ca: Recherche d'entreprise

source: Business Settings
es: Ajustes del negocio
fr_ca: Paramètres de l'entreprise

source: Business Summary
es: Resumen del negocio
fr_ca: Relevé de l'entreprise

source: Buyer
es: Comprador
fr_ca: Acheteur

source: Buyer Information
es: Información del comprador
fr_ca: Informations sur l'acheteur

source: By clicking on the button "Unenroll Now", you acknowledge and agree that you are unenrolling from Automated Payments.
es: Al hacer clic en el botón "Darse de baja", usted reconoce y acepta que se da de baja de Pagos Automáticos.
fr_ca: En cliquant sur le bouton « Me désinscrire maintenant », vous reconnaissez et convenez que vous vous désinscrivez des paiements automatiques.

source: By Stock #, VIN, or Description
es: Por número de inventario, VIN o descripción
fr_ca: Par numéro de stock, NIV, ou description

source: Can't drag &amp; drop?
es: ¿No puede arrastrar y soltar?
fr_ca: Impossible de glisser-déposer?

source: Can't drag &amp; drop?<br><br>
es: ¿No puede arrastrar &amp y soltar?<br><br>
fr_ca: Impossible de glisser-déposer?<br><br>

source: Cancel
es: Cancelar
fr_ca: Annuler

source: Cancel Changes
es: Cancelar cambios
fr_ca: Annuler les modifications

source: Cancel Fee
es: Cancelación de cargo
fr_ca: Frais d'annulation

source: Cancel Payment
es: Cancelar pago
fr_ca: Annuler le paiement

source: Cancel Request
es: Cancelar solicitud
fr_ca: Annuler la demande

source: Cell Phone
es: Teléfono celular
fr_ca: Cellulaire

source: Change Inventory Location
es: Cambiar ubicación del inventario
fr_ca: Modifier l'emplacement de l'inventaire

source: Change Payment Date
es: Cambiar fecha de pago
fr_ca: Modifier la date du paiement

source: Chat
fr_ca: Clavarder

source: Check #
es: Cheque #
fr_ca: No de chèque

source: Check credit availability, floor units and view account activity.
fr_ca: Vérifiez le crédit disponible, les véhicules en nantissement et consultez les activités sur le compte.

source: Check out the new myNextGear menu!
es: ¡Bienvenido(a) al nuevo menú de myNextGear!
fr_ca: Jetez un coup d'œil au nouveau menu myNexGear!

source: Checkout
es: Verificación
fr_ca: Caisse

source: Choose Files
fr_ca: Sélectionnez des fichiers

source: Choose files to Upload
fr_ca: Sélectionnez les fichiers à télécharger

source: City
es: Ciudad
fr_ca: Ville

source: City names must only have letters and spaces.
es: Los nombres de las ciudades solo deben contener letras y espacios.
fr_ca: Les noms de villes ne doivent contenir que des lettres et des espaces

source: Clean
es: Limpio
fr_ca: Propre

source: clear
fr_ca: effacer

source: Clear
es: Eliminar
fr_ca: Effacer

source: Click here
fr_ca: Cliquez ici

source: Click the Add button to add a payoff or a payment.
es: Haga clic en el botón Añadir para agregar una liquidación o un pago.
fr_ca: Cliquez sur le bouton Ajouter pour ajouter un remboursement ou un paiement.

source: Close Window
es: Cerrar ventana
fr_ca: Fermer la fenêtre

source: Collateral Protection
es: Protección de garantía
fr_ca: Protection collatérale

source: Color
fr_ca: Couleur

source: Color &amp; Odometer
fr_ca: Couleur et odomètre

source: Completed
es: Terminado
fr_ca: Terminé

source: Completed/Not Paid
es: Terminado/No pagado
fr_ca: Terminé/Impayé

source: Completed/Paid
es: Terminado/Pagado
fr_ca: Terminé/payé

source: Confirm
es: Confirmar
fr_ca: Confirmer

source: Confirm Account Number
es: Confirmar número de cuenta
fr_ca: Confirmer le numéro de compte

source: Confirm Changes
es: Confirme los cambios
fr_ca: Confirmer les modifications

source: Confirm Flooring Request
es: Confirmar solicitud de piso
fr_ca: Confirmer la demande de financement

source: Confirm Password
es: Confirmar contraseña
fr_ca: Confirmer le mot de passe

source: Confirm Request
es: Confirmar solicitud
fr_ca: Confirmer la demande

source: Confirm Requests
es: Confirmar solicitudes
fr_ca: Confirmer les demandes

source: Confirm the vehicle information to send the flooring request to NextGear Capital. <br>Print this screen for your records.
es: Confirme la información del vehículo para enviar la solicitud de puesta en piso a NextGear Capital. <br>Imprima esta pantalla para sus registros.
fr_ca: Confirmer les informations relatives au véhicule pour envoyer la demande de nantissement à NextGear Capital. <br>Imprimer cet écran pour vos dossiers.

source: Consigner Ticket Number
es: Número de papeleta del remitente
fr_ca: Numéro du billet d'expéditeur

source: Contact Us
es: Póngase en contacto con nosotros
fr_ca: Nous contacter

source: Continue
es: Continuar
fr_ca: Continuer

source: Copy of Signed Bill of Sale
fr_ca: Copie de l'acte de vente signé

source: Copy of Title: Front, Back and All Attachments
fr_ca: Copie du titre : recto, verso et toutes les pièces jointes

source: CPP
fr_ca: PPC

source: Create a New Password
es: Cree una nueva contraseña
fr_ca: Créer un nouveau mot de passe

source: Create your Enhanced Registration four digit PIN.
es: Cree su NIP de cuatro dígitos en Registro Mejorado
fr_ca: Créer votre NIP d'inscription améliorée à quatre chiffres

source: Credit and Payments
fr_ca: Crédit et paiements

source: Credit Availability
fr_ca: Crédit disponible

source: Credit Availability Query History (PDF)
es: Historial de Consulta de Disponibilidad de Crédito (PDF)
fr_ca: Historique de recherche de crédit disponible (PDF)

source: Credit Information
es: Información de crédito
fr_ca: Informations de crédit

source: Credit requests typically take 3-5 business days to process. You will be notified by email as soon as your request has been processed.
es: Las solicitudes de crédito normalmente tardan de 3 a 5 días hábiles. Se le notificará por correo electrónico tan pronto como se haya procesado su solicitud.
fr_ca: Les demandes de crédit sont généralement traitées en 3 à 5 jours ouvrables. Vous serez avisés par courriel aussitôt que votre demande sera traitée.

source: Current Odometer
es: Cuentakilómetros actual
fr_ca: Kilométrique actel

source: Current Reports
es: Informes actuales
fr_ca: Rapports actuels

source: Curtailment Payment
es: Pago con reducción
fr_ca: Paiement de réduction

source: Dashboard
es: Tablero
fr_ca: Tableau de bord

source: Date Range
es: Rango de fechas
fr_ca: Plage de dates

source: Date range based on Date Floored OR Disbursement Date.
es: Rango de fechas basado en fecha de puesta en piso O en fecha de desembolso
fr_ca: Plage de dates selon la date financé OU la date du déboursé.

source: Date Search
es: Búsqueda por fecha
fr_ca: Recherche de date

source: Date Submitted
es: Fecha de envío
fr_ca: Date de soumission

source: days
es: días
fr_ca: jours

source: Days Floored
es: Días de piso
fr_ca: Jours en Financement

source: Days to Turn
es: Días de rotación
fr_ca: Rotation en jours

source: Dealer
es: Distribuidor
fr_ca: Concessionnaire

source: Dealer #
es: Distribuidor #
fr_ca: No de concessionnaire

source: Dealer Information
es: Información del distribuidor
fr_ca: Information sur le concessionnaire

source: Dealer Search
es: Búsqueda de distribuidores
fr_ca: Recherche de concessionnaire
