Repository: gmadala/DP
Catalog: po/*.po
Languages: es, fr_ca

source: Dealer Statement
es: Declaración del distribuidor
fr_ca: Relevé du concessionnaire

source: Default Address
es: Dirección predeterminada
fr_ca: Adresse par défaut

source: Default for deposits
es: Depósitos por defecto
fr_ca: Dépôts par défaut

source: Default for payments
es: Cuenta predeterminada para pagos
fr_ca: Paiements par défaut

source: Delivery Type
es: Tipo de entrega
fr_ca: Type de livraison

source: Denied
es: Negado
fr_ca: Refusé

source: Denied/Not Paid
es: Denegado/No pagado
fr_ca: Refusé/Impayé

source: Deposit Account
fr_ca: Compte de dépôt

source: Deposit Account:
fr_ca: Compte de dépôts :

source: Details
es: Detalles
fr_ca: Détails

source: Disabling the Enhanced Registration Program will delete any current PINs associated with this business.
es: Si desactiva el programa de Registro Mejorado, se borrarán los NIPs actuales relacionados con este negocio.
fr_ca: La désactivation du programme d'inscription améliorée effacera tous les NIP présentement associés à cette entreprise.

source: Disbursement
es: Desembolso
fr_ca: Décaissement

source: Disbursement Date
es: Fecha de desembolso
fr_ca: Date de décaissement

source: Disbursement Detail
es: Detalles del desembolso
fr_ca: Informations sur le décaissement

source: Disbursement Groups
es: Grupos de desembolso
fr_ca: Groupes de décaissement

source: Document Upload
es: Cargar documento
fr_ca: Téléchargement de document

source: Documentation Upload
fr_ca: Téléchargement des documents

source: Does not match with account number.
es: No coincide con el número de cuenta.
fr_ca: Ne correspond pas au numéro de compte.

source: Drag files here...
es: Arrastre los archivos aquí...
fr_ca: Glissez les fichiers ici...

source: Due
es: Vence
fr_ca: Échéance

source: Due Date
es: Fecha de vencimiento
fr_ca: Date d'échéance

source: Due This Month
es: Vence este mes
fr_ca: Dû ce mois-ci

source: Due This Week
es: Vence esta semana
fr_ca: Dû cette semaine

source: Due Today
es: Vence hoy
fr_ca: À Échéance Aujourd'hui

source: Due:
es: Vence:
fr_ca: Échéance :

source: Edit
es: Editar
fr_ca: Modifier

source: Edit Additional Principal
es: Editar capital adicional
fr_ca: Modifier le capital supplémentaire

source: Edit Settings
es: Editar ajustes
fr_ca: Modifier les paramètres

source: Effective Date
es: Fecha de entrada en vigor
fr_ca: Date d'entrée en vigueur

source: Eligible
es: Con derecho
fr_ca: Admissible

source: Eligible for Title Release
es: Tiene derecho a liberación de título
fr_ca: Admissible à l'émission de l'immatriculation

source: Email
es: Correo electrónico
fr_ca: Courriel

source: Email Address
es: Dirección de correo electrónico
fr_ca: Adresse de courriel

source: Enabled
fr_ca: Activé

source: End Date
es: Fecha de terminación
fr_ca: Date d'expiration

source: Enhanced Registration Enabled
es: Registro Mejorado activado
fr_ca: Inscription optimisée activée

source: Enhanced Registration Enabled?
es: ¿Registro Mejorado activado?
fr_ca: Inscription améliorée activée?

source: Enhanced Registration PIN
es: NIP de Registro Mejorado
fr_ca: NIP d'inscription améliorée

source: Enhanced Registration will result in all account access being restricted to users with a PIN.
es: El Registro Mejorado tendrá como resultado que todo el acceso a cuentas se restrinja a usuarios con NIP.
fr_ca: L'inscription optimisée limitera l'accès aux utilisateurs munis d'un NIP.

source: Enhanced Registration will result in all account access being restricted to users with a PIN. All guarantors will be asked to set up their PIN when logging in to myNextGear.
es: El Registro Mejorado tendrá como resultado que todo el acceso a cuentas se restrinja a usuarios con NIP. Se pedirá a todos los fiadores que configuren su NIP cuando inicien una sesión en MyNextGear.
fr_ca: Avec l'inscription améliorée, les accès au compte seront restreints aux usagers disposant d'un NIP. Tous les répondants devront créer un NIP lors de l'ouverture d'une session sur MyNextGear.

source: Enroll in Automated Payments
es: Darse de alta en Pagos Automáticos
fr_ca: S'inscrire aux paiements automatiques

source: Enrolled in Automated Payments
es: Dado de alta en Pagos Automáticos
fr_ca: Inscrit aux paiements automatiques

source: Enter Stock #'s separated by a comma.
es: Capture número de acciones, separado por comas.
fr_ca: Entrez les numéros de stock séparés par une virgule.

source: Enter the email address associated with your account to receive your username via email.
es: Capture la dirección de correo electrónico que tiene asociada a su cuenta para recibir su nombre de usuario por correo electrónico.
fr_ca: Saisissez l'adresse associée à votre compte pour recevoir votre nom d'usager par courriel.

source: Enter your username to receive a new password via email.
es: Capture su nombre de usuario para recibir una nueva contraseña por correo electrónico.
fr_ca: Saisissez votre nom d'usager pour recevoir un nouveau mot de passe par courriel.

source: Error
fr_ca: Erreur

source: Error retrieving schedule information
es: Error al recuperar información del programa
fr_ca: Erreur de récupération du tableau d'information

source: Event Sale
es: Evento de Venta
fr_ca: Activité de vente

source: Export Receipt(s)
es: Exportar recibo(s)
fr_ca: Exportation les reçus

source: Export Receipts
es: Exportar recibos
fr_ca: Exportation des reçus

source: Export Summary
es: Exportar resumen
fr_ca: Relevé d'exportation

source: Exportable Inventory
es: Inventario exportable
fr_ca: Inventaire exportable

source: Extended Term
es: Plazo ampliado
fr_ca: Durée prolongée

source: External Buyer ID
es: Identificación de comprador externo
fr_ca: ID de l'acheteur externe

source: External Seller ID
es: Identificación de vendedor externo
fr_ca: ID du vendeur externe

source: External Stock #
es: Número de inventario externo
fr_ca: No de stock externe

source: Extra Clean
es: Extra limpio
fr_ca: Très Propre

source: Fair
es: Aceptable
fr_ca: Adéquat

source: Fax
fr_ca: Télécopieur

source: FedEx Label
fr_ca: Étiquette FedEx

source: Fee
es: Cargo
fr_ca: Frais

source: Fee - Floorplan/Curtailment
es: Cargo - Plan de piso / Reducción
fr_ca: Frais - Plan de financement / Réduction

source: Fee - Record Services
es: Cargo - Servicios de registro
fr_ca: Frais – Services de dossiers

source: Fee Amount
es: Monto del cargo
fr_ca: Montant des frais

source: Fee Assessed for {{ activity.ActivityAmount | currency }}
es: Cargo evaluado por {{ activity.ActivityAmount | currency }}
fr_ca: Frais évalué à {{ activity.ActivityAmount | currency }}

source: Fee Details
es: Detalles del cargo
fr_ca: Informations sur les frais

source: Fee Type
es: Tipo de cargo
fr_ca: Type de frais

source: Fee(s)
es: Cargo(s)
fr_ca: Frais

source: Feedback & Support
es: Retroalimentación y Apoyo
fr_ca: Commentaires et soutien

source: Fees
es: Cargos
fr_ca: Frais

source: File preview...
es: Vista previa de archivo...
fr_ca: Aperçu du fichier...

source: Fill out for Kelley Blue Book<sup>®</sup>Auction Values
fr_ca: Inscrivez la valeur aux enchčres du Kelley Blue Book<sup>®</sup>

source: Filter by Due Date
es: Filtro por fecha de vencimiento
fr_ca: Filtrer par date d'échéance

source: Filter by Flooring Status
es: Filtro por estado de puesta en piso
fr_ca: Filtrer par statut du financement

source: Filter by Inventory Location
es: Filtro por ubicación de inventario
fr_ca: Filtrer par emplacement d'inventaire

source: Filter by Payment Method
es: Filtro por método de pago
fr_ca: Filtrer par mode de paiement

source: Filter by Status
es: Filtro por estado
fr_ca: Filtrer par Province

source: Filter for VIN (optional)
es: Filtro para VIN (opcional)
fr_ca: Filtre pour NIV (facultatif)

source: Finance Amount
es: Monto del financiamiento
fr_ca: Montant financé

source: Financed Amount
es: Cantidad financiada
fr_ca: Montant financé

source: Financial Accounts
es: Cuentas financieras
fr_ca: Comptes de financement

source: Financial Activity
es: Actividad financiera
fr_ca: Activité financière

source: Find a Dealer
es: Encuentre a un distribuidor
fr_ca: Trouver un concessionnaire

source: Find a Floor Plan
es: Encuentre un plan de piso
fr_ca: Recherche d'un plan de financement

source: Floor a Vehicle
es: Poner un vehículo en piso
fr_ca: Financer un véhicule

source: Floor Another Vehicle
fr_ca: Mettre un autre véhicule en financement

source: Floor Date
es: Fecha de puesta en piso
fr_ca: Date financé

source: Floor Plan
es: Plan de piso
fr_ca: Plan de Financement

source: Floor Plan Comments
es: Comentarios de planes de piso
fr_ca: Commentaires sur le plan de nantissement

source: Floor Plan Search
es: Búsqueda del plan de piso
fr_ca: Recherche des achats au plan de financement

source: Floor Plan Total
es: Total del plan de piso
fr_ca: Total du plan de financement

source: Floor Plan Value Estimates
es: Estimados del valor del plan de piso
fr_ca: Valeurs estimées du plan de nantissement

source: Floor Plan Volume History
es: Historial del volumen del plan de piso
fr_ca: Historique du volume du plan de nantissement

source: Floor Plans
es: Planes de piso
fr_ca: Plans de financement

source: Floored
es: Puesto en piso
fr_ca: Date financé

source: Floored on
fr_ca: Nanti

source: Floored On
es: Puesto en piso con
fr_ca: Date financé le

source: Floored on {{ flooringInfo.FlooringDate | moment }}
es: Puesto en piso con {{ flooringInfo.FlooringDate | moment }}
fr_ca: Date financé le {{ flooringInfo.FlooringDate | moment }}

source: Floored:
es: Puesto en piso:
fr_ca: Nantis :

source: Flooring Information
es: Información de puesta en piso
fr_ca: Informations sur le financement

source: Flooring Status
es: Condición de puesta en piso
fr_ca: Statut du Financement

source: for {{ item.ScheduledDate | moment }}
es: para {{ item.ScheduledDate | moment }}
fr_ca: pour {{ item.ScheduledDate | moment }}

source: for {{ item.ScheduledPaymentDate | moment }}
es: para {{ item.ScheduledPaymentDate | moment }}
fr_ca: pour {{ item.ScheduledPaymentDate | moment }}

source: For faster funding, please upload your floor plan documents now. Document types should include:
es: Para un financiamiento más rápido, cargue los documentos de su plan de piso ahora. Los tipos de documentos que deberían incluirse son:
fr_ca: Pour obtenir un financement plus rapide, téléchargez immédiatement vos documents du plan de nantissement. Voici les types de documents requis :

source: Forgot Your Password?
es: ¿Olvidó su contraseña?
fr_ca: Mot de passe oublié?

source: Forgot Your Username?
es: ¿Olvidó su nombre de usuario?
fr_ca: Nom d'utilisateur oublié?

source: Front of Title
es: Frente del título
fr_ca: Recto du titre

source: Future
es: Futuro
fr_ca: Contrat à terme

source: Future Fees
es: Cargos futuros
fr_ca: Frais futurs

source: Future Payments
es: Pagos Futuros
fr_ca: Paiements futurs

source: Good
es: Bien
fr_ca: Bon

source: Grouped by transaction
es: Agrupados por transacción
fr_ca: Groupés par transaction

source: Hide
fr_ca: Masquer

source: Hide Old Promos
es: Ocultar promociones antiguas
fr_ca: Masquer les anciennes promotions

source: Hide Payment Activity
es: Ocultar actividad de pago
fr_ca: Masquer l'activité de paiement

source: Hide Payment Details
es: Ocultar detalles de pago
fr_ca: Masquer les détails de paiement

source: Historical Reports
es: Reportes históricos
fr_ca: Rapports d'historique

source: How would you rate your experience with flooring online?
fr_ca: Comment évalueriez-vous votre expérience de nantissement en ligne?

source: I acknowledge that I have reviewed and agree.
es: Acepto haberlo revisado y estoy de acuerdo.
fr_ca: Je reconnais avoir lu les conditions et je consens à ces dernières.

source: I forgot
fr_ca: J'ai oublié

source: I have reviewed and agree to the Authorization and Request for Automated Payments.
es: Revisé la Autorización y solicitud de pagos automáticos y estoy de acuerdo con ella.
fr_ca: J'ai lu et j'accepte l'autorisation et la demande de paiements automatiques.

source: I Have the Title
es: Tengo este título
fr_ca: L'enregistrement est en ma possession

source: If you are experiencing an issue logging in, click "Forgot your username or password?" below, or contact:
es: Si está teniendo problemas para conectarse, haga clic en "¿Olvidó su nombre de usuario o contraseña?" abajo o póngase en contacto con:
fr_ca: Si vous éprouvez un problème lors de l'ouverture de session, cliquez ci-dessous sur « Nom d'utilisateur ou mot de passe oublié? » ou contactez:

source: If you wish to view your receipts, please choose from the following formatting options.
es: Si desea ver sus recibos, seleccione una de las siguientes opciones de formato:
fr_ca: Si vous souhaitez visualiser vos reçus, veuillez choisir parmi les options de formatage suivantes.

source: In the Amount of
es: Por la cantidad de
fr_ca: Au montant de

source: Insufficient Funds
es: Fondos insuficientes
fr_ca: Fonds insuffisants

source: Interest
es: Interés
fr_ca: Intérêts

source: Interest & Fees
es: Intereses y cargos
fr_ca: Intérêts et frais

source: interest only
es: únicamente con interés
fr_ca: intérêts seulement

source: Interest-Only Payment
es: Pago únicamente con interés
fr_ca: Paiement d'intérêts seulement

source: Interest, Fees & CPP
es: Intereses, cargos y CPP
fr_ca: Intérêts, frais et CPP

source: Invalid character in VIN
es: Caracter inválido en VIN
fr_ca: Caractère invalide dans le NIV

source: Invalid date range
es: Rango de fechas no válido
fr_ca: Plage de dates invalide

source: invalid files.
es: archivos inválidos.
fr_ca: fichiers invalides.

source: invalid payment type
es: tipo de pago inválido
fr_ca: type de paiement non valide

source: Inventory Address
es: Dirección del inventario
fr_ca: Adresse d'inventaire

source: Inventory Location
es: Ubicación del inventario
fr_ca: Emplacement de l'inventaire

source: Invoice/Bill of Sale
es: Factura / Nota de venta
fr_ca: Facture/contrat de vente

source: is not a valid email address. If you need assistance, please call NextGear Capital Support at:
es: no es una dirección de correo electrónico válida. Si necesita ayuda, por favor llame a Ayuda de NextGear Capital al:
fr_ca: n'est pas une adresse de courriel valide. Si vous avez besoin d'assistance, veuillez communiquer avec le service de soutien NextGear Capital au :

source: It looks like this was the result of either:
es: Parece que éste es el resultado de:
fr_ca: Ceci semble être dû à l'une ou l'autre des raisons suivantes :

source: Items selected on the left will be added to your cart. Make payments today or schedule them for later during checkout.<br><br>
es: Los artículos seleccionados en el lado izquierdo se agregarán a su carrito. Pague hoy o programe sus pagos cuando esté listo para facturar.<br><br>
fr_ca: Les articles sélectionnés à gauche seront ajoutés à votre panier. Vous pourrez effectuer les paiements aujourd'hui ou les programmer pour une date ultérieure au moment de passer à la caisse.<br><br>

source: Kelley Blue Book® Auction Values
es: Valores de Subasta de Kelley Blue Book®
fr_ca: Valeurs aux enchères de Kelley Blue Book®

source: Kelley Blue Book<sup>®</sup> Auction Values
es: Valores de Subasta de Kelley Blue Book<sup>®</sup>
fr_ca: Valeurs aux enchères de Kelley Blue Book<sup>®</sup>

source: Last Payment
es: Último pago
fr_ca: Dernier paiement

source: Last Payment Date
es: Fecha del último pago
fr_ca: Date du dernier paiement

source: Last Payment:
es: Último pago:
fr_ca: Dernier paiement :

source: Legal Name
es: Razón social
fr_ca: Dénomination sociale

source: Let us know the details of the sale
fr_ca: Faites-nous part des détails de la vente

source: limit
fr_ca: limite

source: Line of Credit
es: Línea de crédito
fr_ca: Marge de crédit

source: Line(s) of Credit
es: Línea(s) de crédito
fr_ca: Marge(s) de crédit

source: Location
es: Ubicación
fr_ca: Emplacement

source: Login
fr_ca: Ouverture de session

source: Logout
es: Finalizar sesión
fr_ca: Fermeture de session

source: Look Up Values
es: Buscar valores
fr_ca: Recherche de valeurs

source: Lot Number
es: Número de lote
fr_ca: Numéro de lot

source: Make
es: Marca
fr_ca: Marque

source: Make *
es: Marca *
fr_ca: Effectuer *

source: Make a Payment
es: Hacer pago
fr_ca: Effectuer le paiement

source: Make Selection
es: Seleccione
fr_ca: Faire une sélection

source: Manufacturer Aging Report (PDF)
es: Informe de antigüedad del fabricante (PDF)
fr_ca: Rapport de classement chronologique du fabricant (PDF)

source: Maximum Upload Size: 5MB
fr_ca: Taille maximale des fichiers à télécharger : 5 Mo

source: Mileage
es: Kilometraje
fr_ca: Kilométrage

source: Missing make
es: Falta la marca
fr_ca: Marque non-indiquée

source: Missing mileage
es: Falta el kilometraje
fr_ca: Kilométrage non indiqué

source: Missing model
es: Falta el modelo
fr_ca: Modèle non indiqué

source: Missing style
es: Falta el estilo
fr_ca: Style non indiqué

source: Missing year
es: Falta el año
fr_ca: Année non indiquée

source: MMR Value Vehicle Style
fr_ca: Valeur MMR du modčle du véhicule

source: MMR Values
es: Valores MMR
fr_ca: Valeurs MMR

source: MMR Values not found on record for this vehicle.
es: No se encontraron valores MMR registrados para este vehículo.
fr_ca: Valeurs MMR non trouvées dans les dossiers pour ce véhicule.

source: MMR Wholesale Values
es: Valores de Venta Mayorista de MMR
fr_ca: Valeurs en gros de MMR

source: Model
es: Modelo
fr_ca: Modèle

source: Model *
es: Modelo *
fr_ca: Modèle *

source: Month
es: Mes
fr_ca: Mois

source: Multiple Vehicles Found
es: Se encontraron múltiples vehículos
fr_ca: Plusieurs véhicules identifiés

source: Multiple vehicles were found in our system matching the VIN entered.<br> Please select the intended vehicle from the list below.
es: Se encontraron varios vehículos en nuestro sistema que coinciden con el VIN que capturó. Por favor, seleccione un vehículo de la siguiente lista.
fr_ca: Plusieurs véhicules correspondant au NIV saisi ont été identifiés dans notre système.<br> Veuillez sélectionner le véhicule désiré dans la liste ci-dessous.

source: My Account
es: Mi cuenta
fr_ca: Mon compte

source: myNextGear is currently unavailable while we update it with additional features and benefits. We apologize for the inconvenience and appreciate your patience while we actively work to improve our service to you. Thank you for using myNextGear!
es: myNextGear no está disponible mientras actualizamos características y beneficios adicionales. Les ofrecemos disculpas por las molestias y le agradecemos su paciencia mientras trabajamos activamente para mejorar nuestro servicio. ¡Gracias por utilizar myNextGear!
fr_ca: myNextGear n'est pas accessible pour le moment. Nous effectuons une mise à jour qui permettra d'ajouter de nouvelles fonctionnalités et de nouveaux avantages à notre site. Nous sommes désolés des inconvénients que cela pourrait causer et nous vous remercions pour votre patience pendant que nous améliorons les services que nous vous offrons. Merci d'utiliser myNextGear!

source: n/a
fr_ca: s.o.

source: New Password
es: Contraseña nueva
fr_ca: Nouveau mot de passe

source: Next
fr_ca: Suivant

source: Next payment due {{ financialSummary.NextPaymentDueDate | moment }}
es: El siguiente pago vence {{ financialSummary.NextPaymentDueDate | moment }}
fr_ca: Prochain paiement dû {{ financialSummary.NextPaymentDueDate | moment }}

source: NextGear Capital &amp; MMR Valuation
es: NextGear Capital & Valoración MMR
fr_ca: NextGear Capital et évaluation MMR

source: NextGear Capital Book is {{ businessSummary.DerivedCapitalBook | number:2 }}% of the Purchase Price
es: El libro de NextGear Capital es {{ businessSummary.DerivedCapitalBook | number:2 }}% del precio de compra
fr_ca: La valeur comptable de NextGear Capital représente {{ businessSummary.DerivedCapitalBook | number:2 }} % de la valeur d'achat

source: NextGear Capital Book is {{ businessSummary.DerivedPendingBook | number:2 }}% of the Purchase Price.
es: El libro de NextGear Capital es {{ businessSummary.DerivedPendingBook | number:2 }}% del precio de compra
fr_ca: La valeur comptable de NextGear Capital représente {{ businessSummary.DerivedCapitalBook | number:2 }} % de la valeur d'achat.

source: NextGear Capital Book Values
es: Valores de NextGear Capital Book
fr_ca: Valeurs totales pour NextGear Capital Book

source: NextGear Capital Book Wholesale Values
es: Valores de mayoreo de NextGear Capital Book
fr_ca: Valeurs totales en gros pour NextGear Capital Book

source: NextGear Capital has been notified of this change and will be sending funding soon.
es: Se ha notificado a NextGear Capital de este cambio y pronto le enviará financiamiento.
fr_ca: NextGear Capital a été avisé de cette modification et procédera sous peu à l'envoi du financement.

source: NGC #
fr_ca: NO NGC

source: NGC Buyer #
es: # de comprador NGC
fr_ca: No d'acheteur NGC

source: NGC Stock #
es: # de inventario NGC
fr_ca: No de stock NGC

source: No
fr_ca: Non

source: No notifications are currently enabled.
es: No hay ninguna notificación activada actualmente.
fr_ca: Aucune notification activée.

source: No Payment Activity Available
es: No hay ninguna actividad de pago disponible.
fr_ca: Aucune activité de paiement disponible

source: No Title/Paid
es: Sin título/pagado
fr_ca: Aucun certificat d'immatriculation/Payé

source: No, Thanks
es: No, gracias
fr_ca: Non, merci

source: No.
es: Núm.
fr_ca: Non.

source: none
es: ninguna
fr_ca: aucun

source: None
es: Ninguno
fr_ca: Aucun

source: Not Eligible
es: No elegible
fr_ca: Non admissible

source: Not Eligible for Title Release
es: No es elegible para liberación de título
fr_ca: Non admissible à l'émission du certificat d'immatriculation

source: Not Enrolled? Apply for credit with us.
fr_ca: Pas encore inscrit? Faites une demande de financement avec nous.

source: Not found <span>:(</span>
es: No se encontró <span>:(</span>
fr_ca: Non trouvé <span>:(</span>

source: Not sure what to send?
es: ¿No está seguro(a) de qué enviar?
fr_ca: Incertain de ce que vous devez envoyer?

source: Number of Cars Purchased Per-Auction (in the last 12 months)
es: Cantidad de automóviles comprados por subasta (en los últimos 12 meses)
fr_ca: Nombre de voitures achetées par encan (au cours des 12 derniers mois)

source: Odometer
es: Odómetro
fr_ca: Odomètre

source: OK, I got it!
es: ¡Muy bien, lo tengo!
fr_ca: Nous avons trouvé!

source: One or more files exceeded the 5MB limit.
es: Hay uno o más archivos que exceden el límite de 5 MB.
fr_ca: Un ou plusieurs fichiers dépassaient la limite de 5 Mo.

source: Only purchase price data <br /> is available
fr_ca: Seul le prix d'achat <br /> est disponible

source: Open Audits
fr_ca: Ouvrir les vérifications

source: Optional document upload may include:
es: Cargar un documento opcional puede incluir:
fr_ca: Les documents facultatifs à télécharger peuvent comprendre :

source: Or drag and drop them here
fr_ca: Ou glissez-déposez-les ici

source: Original Term
es: Plazo original
fr_ca: Durée originale

source: Other Documents
es: Otros documentos
fr_ca: Autres documents

source: Other required documents
es: Otros documentos que deben presentarse
fr_ca: Autres documents requis

source: out of
es: de
fr_ca: de

source: Outstanding
es: Pendiente
fr_ca: Dû

source: Overdue
es: Vencido
fr_ca: En retard

source: Page Not Found :(
es: Página no encontrada :(
fr_ca: Page non trouvée :(

source: Paid
es: Pagado
fr_ca: Payé

source: Paid Awaiting Title
es: Pago esperando título
fr_ca: Payé, en attente de l'enregistrement

source: Paid off Summary
es: Resumen de pagos
fr_ca: Sommaire des règlements

source: Password
es: Contraseña
fr_ca: Mot de passe

source: Passwords do not match.
es: Las contraseñas no coinciden.
fr_ca: Les mots de passe ne correspondent pas.
