Repository: gmadala/DP
Catalog: po/*.po
Languages: es, fr_ca

source: This status applies to vehicles floored via NextGearCapital.com or by a NextGear Capital employee via NextGear's Discover system that have been approved and are currently on the NextGear dealer's floor plan.
es: Este estado se aplica a vehículos puestos en piso a través de NextGearCapital.com o por un empleado de NextGear Capital mediante el sistema Discover de NextGear, que hayan sido aprobados y que estén actualmente en el plan de piso de distribuidores de NextGear.
fr_ca: Cet état s'applique aux véhicules nantis par l'entremise de NextGearCapital.com ou par un employé de NextGear Capital par l'entremise du système Discover de NextGear Capital, qui ont été approuvés et qui sont actuellement inscrits au plan de nantissement du concessionnaire NextGear Capital.

source: This status applies to vehicles floored via NextGearCapital.com or by a NextGear Capital employee via NextGear's Discover system that have not yet been approved by a NextGear employee.
es: Este estado se aplica a vehículos puestos en piso a través de NextGearCapital.com o por un empleado de NextGear Capital mediante el sistema Discover de NextGear Capital, que no hayan sido aprobados todavía por algún empleado de NextGear.
fr_ca: Cet état s'applique aux véhicules nantis par l'entremise de NextGearCapital.com ou par un employé de NextGear Capital par l'entremise du système Discover de NextGear, et qui n'ont pas encore été approuvés par un employé de NextGear.

source: This status applies to vehicles floored via NextGearCapital.com that have been denied by a NextGear Capital employee. Please contact NextGear Customer Service to find out why a vehicle has been denied.
es: Este estado se aplica a vehículos puestos en piso a través de NextGearCapital.com que hayan sido rechazados por algún empleado de NextGear Capital. Por favor, póngase en contacto con Servicio a Clientes de NextGear para ver por qué se ha rechazado el vehículo.
fr_ca: Cet état s'applique aux véhicules nantis par l'entremise de NextGearCapital.com qui ont été refusés par un employé de NextGear Capital. Veuillez communiquer avec le service à la clientèle de NextGear pour connaitre les raisons du refus.

source: This week
es: Esta semana
fr_ca: Cette semaine

source: Ticket No.
es: Cupón Núm.
fr_ca: No de ticket

source: Title
es: Título
fr_ca: Certificat d'immatriculation

source: Title Absent
es: Título ausente
fr_ca: Certificat d'immatriculation manquant

source: Title Information
es: Información del título
fr_ca: Informations sur le certificat d'immatriculation

source: Title Location
es: Ubicación del título
fr_ca: Emplacement de I'immatriculation

source: Title Release Limit Reached
es: Límite de liberación de títulos alcanzado
fr_ca: Limite d'émission de certificats d'immatriculation atteinte

source: Title Release Limits:
es: Límite de liberación de títulos:
fr_ca: Limites d'émission de titres :

source: Title Release Requests
es: Solicitudes de liberación de títulos
fr_ca: Demandes d'émission de certificats d'immatriculation

source: Title Release Search
es: Búsqueda de Liberación de Títulos
fr_ca: Recherche de certificats d'immatriculation émis

source: Title Release Unavailable
es: La liberación de títulos no está disponible.
fr_ca: Émission du certificat d'immatriculation non disponible

source: Title Released on
fr_ca: Titre émis le

source: Title Released on {{item.TitleReleaseDate | moment}}
es: Liberación del títulos activada {{item.TitleReleaseDate | moment}}
fr_ca: Certificat d'immatriculation émis le {{item.TitleReleaseDate | moment}}

source: Title Releases
es: Liberación de títulos
fr_ca: Émission d'enregistrements

source: Title Releases Confirmation
es: Confirmación de las liberaciones de títulos
fr_ca: Confirmation de l'émission du certificat d'immatriculation

source: Title Releases list
es: Lista de liberación de títulos
fr_ca: Listes des émissions de titres

source: Title Request
es: Solicitud de títulos
fr_ca: Demande d'un certificat d'immatriculation

source: Title Settings
es: Configuraciones de títulos
fr_ca: Paramètres du certificat d'immatriculation

source: Title State
es: Estatus del título
fr_ca: Statut de l'immatriculation

source: Title/MSO
es: Título / MSO
fr_ca: Titre/MSO

source: Titles Available After This Request
es: Títulos disponibles después de esta solicitud
fr_ca: Certificat d'immatriculation disponible après cette demande

source: Titles can only be released to an address on file. Please select the address where you would like to receive each of your requested titles.
es: Los títulos solo pueden liberarse a una dirección en nuestros archivos. Por favor, seleccione a qué dirección desea recibir cada uno de los títulos solicitados.
fr_ca: Les certificats d'immatriculation ne peuvent être émis qu'à une adresse inscrite au dossier. Veuillez sélectionner l'adresse où vous désirez recevoir les titres demandés.

source: Titles released here are required to be returned within seven days. If you are requesting a title for state work, please <a nxg-chat-with-us="">chat with us</a> or contact customer service for further assistance.
es: Los títulos liberados en el presente documento deberán ser devueltos en siete días. Si está solicitando un título para trabajo estatal, por favor, póngase en contacto con servicio a clientes en <a nxg-customer-support-phone=""></a> para obtener ayuda.
fr_ca: Les certificats d'immatriculation émis ici doivent être retournés dans les sept jours. Si vous demander un certificat d'immatriculation pour un contrat avec un organisme gouvernemental, veuillez communiquer avec le service à la clientèle au <a nxg-customer-support-phone=""></a> pour obtenir de l'aide.

source: Titles Requested
es: Títulos solicitados
fr_ca: Certificats d'immatriculation demandés

source: To change your email address, please contact customer service for further assistance.
es: Para cambiar su dirección de correo electrónico, póngase en contacto con servicio a clientes para recibir ayuda.
fr_ca: Pour modifier votre adresse de courriel, veuillez communiquer avec le service à la clientèle pour obtenir de l'assistance.

source: To change your phone number, please contact customer service for further assistance.
es: Para cambiar su número telefónico, póngase en contacto con servicio a clientes para obtener ayuda.
fr_ca: Pour modifier votre numéro de téléphone, veuillez communiquer avec le service à la clientèle pour obtenir de l'aide.

source: To extend this unit an additional period please click below.
es: Para ampliar esta unidad por un período adicional, por favor, haga clic a continuación.
fr_ca: Pour prolonger cette unité pour une période additionnelle, veuillez cliquer ci-dessous.

source: To floor plan purchases older than 365 days, please contact NextGear Capital Floorplan Services at fundingservices@nextgearcapital.com, attach the Bill of Sale, and provide the customer's NextGear Dealer Number.
es: Para poner en plan de piso compras de más de 365 días, póngase en contacto con Servicios de Plan de Piso de NextGear Capital en fundingservices@nextgearcapital.com, anexe la nota de venta y proporcione el número de cliente de NextGear Capital.
fr_ca: Pour les achats de plans de nantissement datant de plus de 365 jours, veuillez communiquer avec les services de plans de nantissement de NextGear Capital à l'adresse : fundingservices@nextgearcapital.com, annexer l'acte de vente et fournir le numéro de concessionnaire NextGear du client.

source: To floor plan purchases older than 7 days, please contact NextGear Capital Floor plan Services at fundingservices@nextgearcapital.com, attach the Bill of Sale, and provide the customer's NextGear Dealer Number.
es: Para poner en plan de piso compras de más de 7 días, póngase en contacto con Servicios de Plan de Piso de NextGear Capital en fundingservices@nextgearcapital.com, anexe la nota de venta y proporcione el número de cliente de NextGear Capital.
fr_ca: Pour les achats de plans de nantissement datant de plus de 7 jours, veuillez communiquer avec les services de plans de nantissement de NextGear Capital à l'adresse : fundingservices@nextgearcapital.com, annexer l'acte de vente et fournir le numéro de concessionnaire NextGear du client.

source: to return to your dashboard.
fr_ca: retourner au tableau de bord.

source: to select some
es: para seleccionar alguno
fr_ca: pour en sélectionner un certain nombre

source: To update or add a Title Settings address, please contact NextGear Capital at:
es: Para actualizar o agregar una dirección de ajustes de títulos, por favor póngase en contacto con NextGear Capital al:
fr_ca: Pour mettre à jour ou ajouter des paramètres d'adresse à un certificat d'immatriculation, veuillez contacter NextGear Capital au :

source: today
es: hoy
fr_ca: aujourd'hui

source: Today
es: Hoy
fr_ca: Aujourd'hui

source: Today's Fees
es: Cargos de hoy
fr_ca: Frais d'aujourd'hui

source: Toggle navigation
fr_ca: Basculer en mode navigation

source: Total Available
es: Total disponible
fr_ca: Total disponible

source: Total Days Floored
es: Total de días en piso
fr_ca: Total des jours en financement

source: Total Financed Amount
es: Importe total financiado
fr_ca: Total financé

source: Total NextGear Capital Book Value
es: Valor total en libros de NextGear Capital
fr_ca: Valeur comptable totale pour NextGear Capital

source: Total Outstanding
es: Total pendiente
fr_ca: Total dû

source: Total Paid
es: Total pagado
fr_ca: Total payé

source: Total Purchase Price
es: Precio total de compra
fr_ca: Prix d'achat total

source: Tracking Number
es: Número de rastreo
fr_ca: Numéro de suivi

source: Trade in
es: Canje
fr_ca: Reprise

source: Trade-in
es: Canje
fr_ca: Reprise

source: Transaction Details
es: Detalles de la transacción
fr_ca: Informations sur la transaction

source: Unable to communicate with the NextGear Capital system. Please try again later.
es: No es posible establecer comunicación con el sistema NextGear Capital. Por favor, inténtelo más tarde.
fr_ca: Impossible de communiquer avec le système NextGear Capital. Veuillez réessayer plus tard.

source: Unable to Schedule
es: Imposible de programar
fr_ca: Impossible de programmer

source: Unapplied Funds
es: Fondos no aplicados
fr_ca: Fonds non alloués

source: Unapplied funds must be <span ng-bind="unappliedFunds.min() | currency"></span> to <span ng-bind="unappliedFunds.max() | currency"></span>
es: Los fondos no aplicados deben ser <span ng-bind="unappliedFunds.min() | currency"></span> a <span ng-bind="unappliedFunds.max() | currency"></span>
fr_ca: Les fonds non alloués doivent se situer entre <span ng-bind="unappliedFunds.min() | currency"></span> et <span ng-bind="unappliedFunds.max() | currency"></span>

source: Unapplied Funds to Use
es: Fondos no aplicados por usar
fr_ca: Fonds non alloués à utiliser

source: Unenroll from Automated Payments
es: Darse de baja de Pagos Automáticos
fr_ca: Se désinscrire des paiements automatiques

source: Unenroll Now
es: Darse de baja
fr_ca: Me désinscrire maintenant

source: Unit Status
es: Estatus de la unidad
fr_ca: État du véhicule

source: Unschedule
es: Desprogramar
fr_ca: Déprogrammer

source: Unsupported file found in selection.
es: Se encontró un archivo no compatible en la selección.
fr_ca: Un fichier non reconnu a été trouvé dans la sélection.

source: Upcoming Curtailment / Payoff Quote (PDF)
es: Próxima reducción / cotización de pago (PDF)
fr_ca: Réduction à venir / Devis de paiement (PDF)

source: Upload
es: Cargar
fr_ca: Téléchargement

source: Uploaded Documents
es: Documentos cargados
fr_ca: Documents téléchargés

source: User Profile
es: Perfil de usuario
fr_ca: Profil d'usager

source: Username
es: Nombre de usuario
fr_ca: Nom d'usager

source: Utilized
es: Utilizado
fr_ca: Utilisé

source: valid files.
es: archivos válidos.
fr_ca: fichiers valides.

source: Value Lookup
es: Búsqueda de valor
fr_ca: Recherche de valeur

source: Values below will update based on successful VIN or Manual Lookup
es: Los valores que se muestran a continuación se actualizarán con base en la búsqueda exitosa de VIN o en una búsqueda manual
fr_ca: Les valeurs ci-dessous seront mises à jour suite à une recherche de NIV ou une recherche manuelle réussie

source: Vehicle Description
es: Descripción del vehículo
fr_ca: Description du véhicule

source: Vehicle Details
fr_ca: Informations sur le véhicule

source: Vehicle Information
es: Información del vehículo
fr_ca: Informations sur le véhicule

source: Vehicle Payments
es: Pagos del vehículo
fr_ca: Paiements par véhicule

source: Vehicle Value Comparison
fr_ca: Comparaison de la valeur du véhicule

source: Vehicles Floored
es: Vehículos puestos en piso
fr_ca: Véhicules en financement

source: Very Good
es: Muy bien
fr_ca: Très bon

source: View
fr_ca: Visualiser

source: View All
es: Ver todo
fr_ca: Voir tous

source: View All Auctions
es: Ver todas las subastas
fr_ca: Voir tous les encans

source: View All Payments
es: Ver todos los pagos
fr_ca: Voir tous les paiements

source: View All Receipts
es: Ver todos los recibos
fr_ca: Voir tous les reçus

source: View Dealer Funding Checklist (PDF)
es: Ver lista de verificación de financiamiento del distribuidor (PDF)
fr_ca: Voir la liste de financement du concessionnaire (PDF)

source: View Floor Plan
es: Ver plan de piso
fr_ca: Voir au plan de financement

source: View Report
es: Ver informe
fr_ca: Voir le rapport

source: View the Dealer Funding Checklist.
es: Ver lista de verificación de financiamiento del distribuidor
fr_ca: Voir la liste de vérification de financement du concessionnaire.

source: View the Title
es: Ver el título
fr_ca: Voir l'enregistrement

source: View the Vehicle History Detail Report
es: Ver el informe detallado del historial del vehículo
fr_ca: Voir le rapport d'historique détaillé du véhicule

source: VIN
fr_ca: NIV

source: VIN should be 10 - 17 characters.
es: El número ViN debe constar de 10 a 17 caracteres.
fr_ca: Le NIV doit contenir entre 10 et 17 caractères.

source: VIN should be 6 to 17 characters.
es: El número VIN debe tener 17 caracteres.
fr_ca: Le NIV doit contenir de 6 à 17 caractères.

source: VIN should only contain alphanumeric characters.
es: El número VIN debe tener únicamente caracteres alfanuméricos
fr_ca: Le NIV ne doit contenir que des caractères alphanumériques.

source: VIN was not located; please enter Make, Model, Year and Style.
es: No se encontró el número VIN, por favor, ingrese marca, modelo, año y estilo.
fr_ca: Le NIV n'a pas été trouvé; veuillez inscrire la marque, le modèle, l'année et le style.

source: VIN, Make, Model, or Year
es: VIN, marca, modelo o año
fr_ca: NIV, marque, modèle, ou année

source: Voided
es: Anulado
fr_ca: Annulé

source: We are sorry, but we are unable to provide Kelley Blue Book<sup>®</sup> values at this time.
es: Lo sentimos, pero no podemos proporcionarle valores de Kelley Blue Book<sup>®</sup> en este momento.
fr_ca: Nous sommes désolés, mais nous ne sommes pas en mesure de fournir les valeurs de Kelley Blue Book<sup>®</sup> en ce moment.

source: We are sorry, but we are unable to provide MMR Values at this time.
es: Lo sentimos, pero no podemos proporcionarle valores MMR en este momento.
fr_ca: Nous sommes désolés, mais nous ne sommes pas en mesure d'offrir les valeurs MMR en ce moment.

source: We are sorry, but we are unable to provide NextGear Capital Book Values at this time.
es: Lo sentimos, pero no podemos proporcionarle valores de NextGear Capital Book en este momento.
fr_ca: Nous sommes désolés, mais nous ne sommes pas en mesure d'offrir les valeurs de NextGear Capital Book en ce moment.

source: We are sorry, but we do not recognize this VIN. If your VIN was entered correctly, you can still submit your request.
fr_ca: Nous sommes désolés, mais nous ne parvenons pas ŕ reconnaitre ce NIV. Si votre NIV a été entré correctement, vous pouvez continuer la soumission de votre demande.

source: We were unable to locate this email address. If you need assistance, please call NextGear Capital Support at:
es: No encontramos esta dirección de correo electrónico. Si necesita ayuda, por favor llame a Apoyo de NextGear Capital al:
fr_ca: Nous n'avons pu trouver cette adresse de courriel. Si vous avez besoin d'assistance, veuillez communiquer avec le soutien NextGear Capital au :

source: We were unable to locate this username. If you need assistance, please call NextGear Capital Support at:
es: No encontramos este nombre de usuario. Si necesita ayuda, por favor llame a Apoyo de NextGear Capital al:
fr_ca: Nous n'avons pu trouver ce nom d'utilisateur. Si vous avez besoin d'assistance, veuillez communiquer avec le service de soutien de NextGear Capital au :

source: We were unable to pull one or more bookout values from our partner.
fr_ca: Nous sommes incapables de retirer une ou plusieurs valeurs aux livres de votre partenaire.

source: We were unable verify one or more of your answers. If you need assistance, please call NextGear Capital Support at:
es: No pudimos verificar algunas de sus respuestas. Si necesita ayuda, por favor llame a Apoyo de NextGear Capital al:
fr_ca: Nous n'avons pu vérifier une ou plusieurs de vos réponses. Si vous avez besoin d'assistance, veuillez communiquer avec le service de soutien de NextGear Capital au :

source: We Will Be Back Soon!
es: ¡Regresaremos en breve!
fr_ca: Nous serons de retour bientôt!

source: We're sorry, but you used a username or password that doesn't match our records.
es: Disculpe, pero utilizó un nombre de usuario o una contraseña que no se encuentra en nuestros registros.
fr_ca: Nous sommes désolés, mais vous avez utilisé un nom d'utilisateur ou un mot de passe qui ne correspond pas à nos dossiers.

source: We're sorry, the highlighted title(s) listed above cannot be processed at this time. Please call Customer Service at
fr_ca: Nous sommes désolés, il est actuellement impossible de traiter le(s) titre(s) sélectionné(s) affichés ci-dessus. Veuillez communiquer avec le service ŕ la clientčle au

source: We're sorry, this title is unavailable for release at this time. If you would like more information about this title, please call Dealer Services at {{ phoneNumber }}.
es: Lo sentimos, este título no está disponible para su liberación en este momento. Si requiere más información acerca de dicho título, por favor llame a Servicio a Distribuidores al {{ phoneNumber }}.
fr_ca: Nous sommes désolés, ce certificat d'immatriculation ne peut être émis en ce moment. Si vous désirez plus d'informations au sujet de ce titre, veuillez contacter les services au concessionnaire, au {{ phoneNumber }}.

source: We're sorry, we were unable to find this VIN. This looks like a passenger vehicle. Please select the year, make, model and style below.
fr_ca: Nous sommes désolés, nous ne parvenons pas à trouver ce NIV. Il semble qu'il s'agisse d'un véhicule de promenade. Veuillez sélectionner l'année, la marque, le modèle et le style ci-dessous.

source: Week
es: Semana
fr_ca: Semaine

source: Welcome
es: Bienvenido(a)
fr_ca: Bienvenue

source: Welcome to myNextGear!
es: ¡Bienvenido(a) a myNextGear!
fr_ca: Bienvenue chez MyNextGear!

source: What all do I need to attach for my flooring request?
fr_ca: Quels documents dois-je joindre à ma demande de nantissement?

source: Where can I find my account and routing numbers?
es: ¿Dónde puedo encontrar mis números de cuenta y de enrutamiento?
fr_ca: Où puis-je trouver mes numéros de compte et d'acheminement?

source: Who do you want to pay?
fr_ca: Ŕ qui désirez-vous effectuer votre paiement?

source: Who has the Title?
es: ¿Quién tiene el título?
fr_ca: Qui possède le certificat d'immatriculation?

source: Worst Movers
es: Los que se mueven menos
fr_ca: Pires taux de roulement

source: Would you like to cancel your scheduled fee?
es: ¿Desea cancelar su cargo programado?
fr_ca: Voulez-vous annuler vos frais programmés?

source: Would you like to cancel your scheduled payment?
es: ¿Desea cancelar su pago programado?
fr_ca: Voulez-vous annuler votre paiement programmé?

source: Would you like to disable Enhanced Registration?
es: ¿Desea desactivar Registro Mejorado?
fr_ca: Voulez-vous désactiver l'inscription améliorée?

source: Year
es: Año
fr_ca: Année

source: Year *
es: Año *
fr_ca: Année *

source: Yes
es: Sí
fr_ca: Oui

source: Yes, I want to enroll
es: Sí, quiero darme de alta
fr_ca: Oui, je souhaite m'inscrire

source: You are about to enroll in Automated Payments. Please review the Authorization and Request for Automated Payments below.
es: Está a punto de darse de alta en Pagos Automáticos. Revise la Autorización y la solicitud para darse de alta en Pagos Automáticos que aparece a continuación.
fr_ca: Vous êtes sur le point de vous inscrire aux paiements automatiques. Veuillez lire l'autorisation et la demande de paiements automatiques ci-dessous.

source: You are enrolled in Automated Payments. All payments will be processed automatically on their due date.
es: Usted se dio de alta en Pagos Automáticos. Todos los pagos se procesarán automáticamente en la fecha de vencimiento.
fr_ca: Vous êtes inscrit aux paiements automatiques. Tous les paiements seront traités automatiquement à leur date d'échéance.

source: You can combine up to 20 receipts into a single pdf by selecting each receipt and clicking 'Export Receipt(s)' below.
es: Usted puede combinar hasta 20 recibos en un solo PDF seleccionando cada recibo y hacienda clic en Exportar recibo(s) a continuación.
fr_ca: Vous pouvez combiner jusqu'à 20 reçus dans un seul PDF en sélectionnant chaque reçu et en cliquant ci-dessous sur « Exporter les reçus ».

source: You can only floor a vehicle purchased on or after
fr_ca: Vous ne pouvez nantir qu'un véhicule acheté le ou après le

source: You currently have no open audits.
fr_ca: Vous n'avez actuellement aucune vérification d'ouverte.

source: You do not appear to have any security questions configured. Please contact NextGear Capital for assistance.
es: Al parecer, no tiene ninguna pregunta de seguridad configurada. Por favor, póngase en contacto con NextGear Capital para obtener ayuda.
fr_ca: Vos questions de sécurité ne semblent pas avoir été configurées. Veuillez contacter NextGear Capital afin d'obtenir de l'assistance.

source: You entered a future date. You can only floor a vehicle purchased on or before
fr_ca: Vous avez entré une date ultérieure. Vous ne pouvez nantir qu'un véhicule acheté le ou avant le

source: You have
es: Usted
fr_ca: Vous avez

source: You have logged in outside of business hours. Any payments made will be scheduled to be applied on the next available business day, {{ nextBusinessDay | moment }}.
es: Usted ha ingresado en horas no hábiles. Cualquier pago que haya realizado se aplicará el siguiente día hábil, {{ nextBusinessDay | moment }}.
fr_ca: Vous avez ouvert une session en dehors des heures d'ouverture. Tous les paiements effectués seront programmés pour le jour ouvrable suivant, {{ nextBusinessDay | moment }}.

source: You have no payments selected for checkout. Please visit the
es: No tiene ningún pago seleccionado para verificación. Por favor, visite la
fr_ca: Vous n'avez pas de paiements sélectionnés pour la caisse. Veuillez visiter le

source: You have not selected any titles. Please visit the
es: No ha seleccionado ningún título. Por favor, visite la
fr_ca: Vous n'avez aucun titre sélectionné. Veuillez visiter le

source: You may select an already approved address on file with NextGear Capital.
es: Puede seleccionar una dirección que ya haya sido aprobada en el archivo de NextGear Capital.
fr_ca: Vous pouvez sélectionner une adresse apparaissant au dossier déjà approuvée par NextGear Capital.

source: You will receive an email confirmation shortly at
fr_ca: Vous recevrez sous peu un courriel de confirmation ŕ

source: Your account was saved successfully.
es: Su cuenta se guardó con éxito.
fr_ca: Votre compte a été sauvegardé avec succès.
