Repository: gmadala/DP
Catalog: po/*.po
Languages: es, fr_ca

source: Passwords must consist of a minimum of 8 characters. Passwords must contain 3 of the 4 following types of characters: uppercase, lowercase, number, or special character.
es: Las contraseñas deben consistir de por lo menos 8 caracteres. Las contraseñas deben contener 3 de los 4 tipos siguientes de caracteres: mayúsculas, minúsculas, número o carácter especial.
fr_ca: Les mots de passe doivent contenir un minimum de 8 caractères. Les mots de passe doivent contenir 3 des 4 types de caractères suivants : majuscules, minuscules, nombres ou caractères spéciaux.

source: Pay me
fr_ca: Payez ŕ moi

source: Pay off this vehicle or return the title to remove from your limit.
es: Pague este vehículo o devuelva el título para retirarlo de su límite.
fr_ca: Payez ce véhicule ou retournez l'immatriculation pour le retirer de votre limite.

source: Pay someone else
fr_ca: Payez ŕ quelqu'un d'autre

source: Payee
fr_ca: Bénéficiaire

source: payment
es: pago
fr_ca: paiement

source: Payment
es: Pago
fr_ca: Paiement

source: Payment Account:
fr_ca: Compte de paiement :

source: Payment Amount
es: Importe del pago
fr_ca: Montant du paiement

source: Payment Breakdown
es: Desglose del pago
fr_ca: Ventilation du paiement

source: Payment Date
es: Fecha de pago
fr_ca: Date du paiement

source: Payment Date:
es: Fecha de pago:
fr_ca: Date du paiement :

source: Payment Description
es: Descripción del pago
fr_ca: Description du paiement

source: Payment Details
es: Detalles del pago
fr_ca: Informations sur le paiement

source: Payment Due
es: Pago vence
fr_ca: Paiement dû

source: Payment Information
fr_ca: Informations de paiement

source: Payment Made
es: Pago realizado
fr_ca: Paiement effectué

source: Payment Made for {{ activity.ActivityAmount | currency }}
es: Pago hecho a {{ activity.ActivityAmount | currency }}
fr_ca: Paiement effectué de {{ activity.ActivityAmount | currency }}

source: Payment Method
es: Método de pago
fr_ca: Mode de paiement

source: Payment Options
es: Opciones de pago
fr_ca: Options de paiement

source: Payment Options &amp; Breakdown
es: Opciones de pago & desglose
fr_ca: Ventilation et options de paiement

source: Payment Options<br> &amp; Breakdown
es: Opciones de pago<br> y desglose
fr_ca: Ventilation <br>et options de paiement

source: Payment Search
es: Búsqueda de pago
fr_ca: Recherche de paiement

source: Payment Summary
es: Resumen del pago
fr_ca: Sommaire des Paiements

source: Payment Total
es: Total del pago
fr_ca: Total du paiement

source: Payment:
es: Pago:
fr_ca: Paiement :

source: Payment: Future
es: Pago: Futuro
fr_ca: Paiement : date ultérieure

source: Payment: Today
es: Pago: Hoy
fr_ca: Paiement : aujourd'hui

source: Payments
es: Pagos
fr_ca: Paiements

source: Payments are unable to be scheduled for loans that are overdue or due today.
es: No pueden programarse pagos de préstamos vencidos o que venzan el día de hoy.
fr_ca: Les paiements ne peuvent être programmés pour les prêts en retard ou qui viennent à échéance aujourd'hui.

source: Payments Due
es: Pagos vencen
fr_ca: Paiements dûs

source: Payments list
es: Lista de pagos
fr_ca: Liste des paiements

source: Payments Summary
es: Resumen de pagos
fr_ca: Sommaire des Paiements

source: payoff
es: pagado
fr_ca: remboursement

source: Payoff
es: Pagado
fr_ca: Remboursement

source: Payoff Due
es: Pagos vencidos
fr_ca: Remboursement dû

source: Payoff this vehicle
es: Pague este vehículo
fr_ca: Rembourser ce véhicule

source: Payoffs Due
es: Pagos vencidos
fr_ca: Remboursements dûs

source: Payout Amount
es: Importe del pago
fr_ca: Montant du paiement

source: Payout Amount must be $0.01 to {{ funds.available | currency }}
es: El importe del pago debe ser de $0.01 a: {{ funds.available | currency }}
fr_ca: Le montant du paiement doit se situer entre 0,01 $ et {{ funds.available | currency }}

source: Payout Amount must be $0.01 to {{ maxAdditional | currency }}
es: El importe del pago debe ser de $0.01 a {{ maxAdditional | currency }}
fr_ca: Le montant du paiement doit se situer entre 0,01 $ et {{ maxAdditional | currency }}

source: Pending
es: Pendiente
fr_ca: En attente

source: Pending Floor Plans
es: Planes pendientes de puesta en piso
fr_ca: Financements en attente

source: Pending/Not Paid
es: Pendiente/No pagado
fr_ca: En attente/Impayé

source: Phone
es: Teléfono
fr_ca: Téléphone

source: PIN
es: NIP
fr_ca: NIP

source: Please <a nxg-chat-with-us="">chat with us</a> or contact customer service for further assistance.
es: Por favor, <a nxg-chat-with-us="">chatee con nosotros</a> o póngase en contacto con el servicio a clientes para recibir ayuda.
fr_ca: Veuillez <a nxg-chat-with-us="">clavarder avec nous</a> ou contacter le service à la clientèle pour obtenir de l'assistance.

source: Please acknowledge VIN look-up failure.
es: Por favor, reconozca la falla de búsqueda de VIN.
fr_ca: Veuillez confirmer l'échec de recherche du NIV.

source: Please answer this question.
es: Por favor, responda a la pregunta.
fr_ca: Veuillez répondre à cette question

source: Please be advised that such title(s) must be returned to NextGear Capital, at the address listed below, by close of business on the seventh (7th) day after the date of NextGear Capital's release of such title(s) to you. You understand and agree that NextGear Capital will declare a Maturity Event (as such term is defined in your Demand Promissory Note and Loan and Security Agreement ("Note")) and initiate a Required Payment (as such term is defined in your ACH Authorization and Request Form) for all Liabilities (as defined in your Note) related to any title(s) not returned to NextGear Capital within such time frame. You agree that each Required Payment made pursuant to this request shall be deemed an Authorized Debit under your ACH Form.
es: Se le informa que dicho(s) título(s) deberá(n) devolverse a NextGear Capital, en la dirección que se menciona a continuación, a más tardar al cierre del séptimo (7°) día después de la fecha en que NextGear Capital le libere el(los) título(s). Usted entiende y acepta que NextGear Capital puede declarar un evento de vencimiento (conforme a la definición de dicho término en su Pagaré de demanda y en el Contrato de Crédito y Garantía ("Pagaré")) y se deberá hacer el Pago requerido (conforme a la definición de dicho término en su Formulario de Autorización y Solicitud de ACH) de todos los pasivos (conforme a la definición mencionada en su Pagaré) relacionados con el(los) título(s) que no se haya(n) devuelto a NextGear Capital en el mencionado plazo. Usted acepta que cada Pago requerido que se haga conforme a esta solicitud se considerará como débito autorizado conforme al Formulario ACH.
fr_ca: Veuillez noter que ces certificats d'immatriculation doivent être retournés à NextGear Capital, à l'adresse indiquée ci-dessous, au plus tard à la fermeture des bureaux le septième (7e) jour suivant la date d'émission du certificat d'immatriculation par NextGear Capital à votre intention. Vous comprenez et vous acceptez que NextGear Capital déclarera en cas d'échéance (comme défini dans votre billet à ordre et dans votre contrat de garantie de prêt [« Billet »]) et amorcera une demande de paiement (comme définie dans votre Formulaire de demande et d'autorisation ACH) pour tout passif (comme définis dans votre billet) lié à tout certificat d'immatriculation non retourné à NextGear Capital dans ces délais. Vous convenez que tout paiement demandé et effectué conformément à cette demande sera considéré comme un débit autorisé en vertu de votre formulaire ACH.

source: Please choose a line of credit.
es: Por favor, seleccione una línea de crédito.
fr_ca: Veuillez sélectionner une marge de crédit.

source: Please confirm the account number.
es: Confirme el número de cuenta.
fr_ca: Veuillez confirmer le numéro de compte.

source: Please confirm your title release request(s) below.
es: Por favor, a continuación confirme la(s) solicitud(es) de liberación de títulos.
fr_ca: Veuillez confirmer la demande d'émission des certificats d'enregistrements ci-dessous.

source: Please contact customer service for further assistance.
es: Por favor, póngase en contacto con servicio a clientes para obtener ayuda.
fr_ca: Veuillez communiquer avec le service à la clientèle pour obtenir plus d'aide.

source: Please contact your local representative for details about the Promotions and Event Sales listed below.
es: Por favor, póngase en contacto con su representante local para obtener información sobre las Promociones e Eventos de Ventas que se enumeran a continuación.
fr_ca: Veuillez communiquer avec votre représentant local pour tout détail au sujet des Promotions et des Activités de Ventes indiquées ci-dessous.

source: Please enter a bank name.
es: Escriba el nombre del banco.
fr_ca: Veuillez entrer le nom d'une banque.

source: Please enter a business name or number to search.
es: Por favor, ingrese un nombre o número de negocio para hacer una búsqueda.
fr_ca: Veuillez entrer un nom ou un numéro d'entreprise à rechercher.

source: Please enter a city.
es: Escriba la ciudad.
fr_ca: Veuillez entrer le nom d'une ville.

source: Please enter a Consigner Ticket Number.
es: Por favor, ingrese el número de cupón del remitente.
fr_ca: Veuillez entrer un numéro de billet d'expéditeur.

source: Please enter a four-digit Year.
es: Por favor, capture un año de cuatro dígitos.
fr_ca: Veuillez inscrire une année comportant quatre chiffres.

source: Please enter a Make.
es: Por favor, capture la marca.
fr_ca: Veuillez inscrire une marque.

source: Please enter a Model.
es: Por favor, capture el modelo.
fr_ca: Veuillez inscrire un modèle.

source: Please enter a name, and city or state, to search.
es: Por favor, ingrese un nombre, ciudad o estado para hacer una búsqueda.
fr_ca: Veuillez entrer un nom, une ville ou une province à rechercher.

source: Please enter a numeric value with no more than 2 decimal places.
es: Por favor, capture un valor numérico con un máximo de 2 lugares decimales.
fr_ca: Veuillez inscrire une valeur numérique avec un maximum de 2 décimales.

source: Please enter a password.
es: Por favor, ingrese una contraseña.
fr_ca: Veuillez entrer un mot de passe.

source: Please enter a Payout Amount.
es: Por favor, capture la cantidad de pago.
fr_ca: Veuillez inscrire un montant payable.

source: Please enter a positive integer value with no decimals.
es: Por favor, ingrese un número entero positivo sin decimales.
fr_ca: Veuillez entrer un nombre entier sans décimales.

source: Please enter a positive numeric value with no <br> special characters, such as a dollar sign.
es: Por favor, ingrese un valor numérico positivo sin caracteres especiales <br> como el signo de pesos.
fr_ca: Veuillez inscrire une valeur numérique positive sans <br> caractères spéciaux comme le signe de dollar.

source: Please enter a positive numeric value with no more than 2 decimal places.
es: Por favor, ingrese un valor numérico positivo con un máximo de 2 decimales.
fr_ca: Veuillez inscrire une valeur numérique positive avec un maximum de 2 décimales.

source: Please enter a routing number.
es: Escriba el número de enrutamiento.
fr_ca: Veuillez entrer un numéro d'acheminement.

source: Please enter a Start Stock Number
es: Por favor, capture un número de inventario de inicio válido.
fr_ca: Veuillez inscrire un numéro de stock de départ

source: Please enter a state.
es: Escriba el estado.
fr_ca: Veuillez entrer le nom d'une province.

source: Please enter a Style.
es: Por favor, capture el estilo.
fr_ca: Veuillez inscrire un style.

source: Please enter a Username that is 40 characters or less.
es: Por favor, ingrese un nombre de usuario de 40 caracteres o menos.
fr_ca: Veuillez entrer un nom d'usager de 40 caractères ou moins.

source: Please enter a username.
es: Por favor, ingrese un nombre de usuario.
fr_ca: Veuillez entrer un nom d'usager.

source: Please enter a Username.
es: Por favor, ingrese un nombre de usuario.
fr_ca: Veuillez entrer un nom d'usager.

source: Please enter a valid 5 digit Zip.
es: Ingrese un código postal de cinco dígitos.
fr_ca: Veuillez entrer un code postal valide à cinq chiffres.

source: Please enter a valid email address.
es: Por favor, ingrese una dirección de correo electrónico válida.
fr_ca: Veuillez entrer une adresse de courriel valide.

source: Please enter a Valid End Date.
es: Por favor, capture una fecha final válida.
fr_ca: Veuillez entrer une date de fin valide.

source: Please enter a valid End Stock Number
es: Por favor, capture un número de inventario final válido.
fr_ca: Veuillez inscrire un numéro de fin de stock valide

source: Please enter a valid fax number.
es: Ingrese un número de fax válido
fr_ca: Veuillez entrer un numéro de télécopieur valide.

source: Please enter a valid password.
es: Por favor, ingrese una contraseña válida.
fr_ca: Veuillez entrer un mot de passe valide.

source: Please enter a valid phone number.
es: Por favor, ingrese un número de teléfono válido.
fr_ca: Veuillez entrer un numéro de téléphone valide.

source: Please enter a valid purchase date (mm/dd/yyyy).
fr_ca: Veuillez entrer une date d'achat valide (jj//mm/aaaa).

source: Please enter a Valid Purchase Date.
es: Por favor, ingrese una fecha de compra válida.
fr_ca: Veuillez entrer une date d'achat valide.

source: Please enter a Valid Sale Date.
es: Por favor, capture una fecha de venta válida.
fr_ca: Veuillez entrer une date de vente valide.

source: Please enter a Valid Start Date.
es: Por favor, capture una fecha de inicio válida.
fr_ca: Veuillez entrer une date de début valide.

source: Please enter a valid Start Stock Number
es: Por favor, capture un número de inventario inicial válido.
fr_ca: Veuillez inscrire un numéro de stock de départ valide

source: Please enter a valid street address.
es: Escriba una dirección válida.
fr_ca: Veuillez entrer une adresse valide.

source: Please enter a value less than $400,000.
fr_ca: Veuillez entrer une valeur inférieure ŕ 400 000 $.

source: Please enter a value less than 1,000,000.
es: Por favor, ingrese un valor menor a 1,000,000.
fr_ca: Veuillez entrer une valeur inférieure à 1 000 000.

source: Please enter a VIN.
es: Por favor, capture el número VIN.
fr_ca: Veuillez inscrire un NIV.

source: Please enter a Year between 1901 and {{ settings.maxYear }}.
es: Por favor, capture un año entre 1901 y {{ settings.maxYear }}.
fr_ca: Veuillez inscrire une date (année) entre 1901 et {{ settings.maxYear }}.

source: Please enter a Year.
es: Por favor, capture el año.
fr_ca: Veuillez inscrire une année.

source: Please enter an account number.
es: Escriba el número de cuenta.
fr_ca: Veuillez entrer un numéro de compte.

source: Please enter an address.
es: Escriba la dirección.
fr_ca: Veuillez entrer une adresse.

source: Please enter an Answer that is a maximum of 100 characters.
es: Por favor, ingrese una respuesta que tenga 100 caracteres como máximo.
fr_ca: Veuillez entrer une réponse contenant un maximum de 100 caractères.

source: Please enter an answer that is no more than 100 characters long.
es: Por favor, ingrese una respuesta que no tenga más de 100 caracteres.
fr_ca: Veuillez entrer une réponse ne contenant pas plus de 100 caractères.

source: Please enter an answer to the selected security question.
es: Por favor, ingrese una respuesta a la pregunta de seguridad seleccionada.
fr_ca: Veuillez entrer une réponse à la question de sécurité sélectionnée.

source: Please enter an Answer.
es: Por favor, ingrese una respuesta.
fr_ca: Veuillez entrer une réponse.

source: Please enter an End Stock Number
es: Por favor, capture un número de inventario final.
fr_ca: Veuillez inscrire un numéro de fin de stock

source: Please enter an End Stock Number that is greater than the Start Stock Number
es: Por favor, capture un número de inventario final que sea mayor al número del inventario inicial.
fr_ca: Veuillez inscrire un numéro de fin de stock supérieur au numéro de stock de départ

source: Please enter an increase amount.
es: Por favor, ingrese una cantidad a aumentar.
fr_ca: Veuillez entrer un montant d'augmentation.

source: Please enter any additional comments you have for our team
fr_ca: Veuillez entrer tout commentaire additionnel que vous aimeriez transmettre à notre équipe

source: Please enter at least 3 characters.
es: Por favor, ingrese por lo menos 3 caracteres.
fr_ca: Veuillez entrer au moins 3 caractères.

source: Please enter one or more Stock Numbers
es: Por favor, capture uno o más números de inventario.
fr_ca: Veuillez inscrire un numéro de stock ou plus

source: Please enter the
es: Por favor, ingrese el
fr_ca: Veuillez entrer le

source: Please enter the amount of unapplied funds as a number with no more than 2 decimals.
es: Por favor, ingrese el importe de los fondos no aplicados con caracteres numéricos con un máximo de 2 decimales.
fr_ca: Veuillez inscrire le montant des fonds non alloués avec un nombre ne contenant pas plus de 2 décimales.

source: Please enter the amount of unapplied funds to use.
es: Por favor, ingrese el importe de los fondos no aplicados que se usarán.
fr_ca: Veuillez entrer le montant des fonds non alloués à utiliser.

source: Please enter the Lot Number.
es: Por favor, ingrese el número de lote.
fr_ca: Veuillez entrer le numéro de lot.

source: Please enter the Mileage.
es: Por favor, ingrese el kilometraje.
fr_ca: Veuillez entrer le kilométrage.

source: Please enter the Purchase Amount
es: Por favor, ingrese el importe de la compra.
fr_ca: Veuillez entrer le montant d'achat

source: Please enter the purchase amount.
fr_ca: Veuillez entrer le montant d'achat.

source: Please enter the Purchase Amount.
es: Por favor, ingrese el importe de la compra.
fr_ca: Veuillez entrer le montant d'achat.

source: Please enter the Zip.
es: Ingrese el código postal.
fr_ca: Veuillez entrer le code postal.

source: Please enter value less than $1,000,000,000,000.00.
es: Por favor, ingrese un valor menor a $1,000,000,000,000.00.
fr_ca: Veuillez entrer une valeur inférieure à 1 000 000 000 000,00 $.

source: Please enter your email address. If you need assistance, please call NextGear Capital Support at:
es: Por favor, ingrese su dirección de correo electrónico. Si necesita ayuda, llame a Apoyo de NextGear Capital al:
fr_ca: Veuillez entrer votre adresse de courriel. Si vous avez besoin d'assistance, veuillez communiquer avec le soutien NextGear Capital au :

source: Please enter your username. If you need assistance, please call NextGear Capital Support at:
es: Por favor, ingrese su nombre de usuario. Si necesita ayuda, llame a Apoyo de NextGear Capital al:
fr_ca: Veuillez entrer votre nom d'usager. Si vous avez besoin d'assistance, veuillez communiquer avec le soutien NextGear Capital au :

source: Please look up a Buyer.
es: Por favor, busque a un comprador:
fr_ca: Veuillez rechercher un acheteur.

source: Please look up a Seller.
es: Por favor, busque a un vendedor:
fr_ca: Veuillez rechercher un vendeur.

source: Please look up the VIN.
es: Por favor, busque el VIN.
fr_ca: Veuillez rechercher le NIV.

source: Please note this quote is effective for today only and amounts are subject to change.
es: Por favor, tome en cuenta que esta cotización es válida para el día de hoy únicamente y que las cantidades están sujetas a cambio.
fr_ca: Veuillez noter que ce devis n'est valide qu'aujourd'hui et que les montants sont sujets à modification.

source: Please only enter numbers, commas, or spaces in this field.
es: Por favor, capture únicamente números, comas o espacios en este campo.
fr_ca: Veuillez n'inscrire que des nombres, des virgules ou des espaces dans ce champ.

source: Please review the following and submit your payments below.
es: Por favor, revise lo siguiente y envíe sus pagos a continuación.
fr_ca: Veuillez réviser ce qui suit et soumettre vos paiements ci-dessous.

source: Please review your floor plan request.
fr_ca: Veuillez réviser votre demande de plan de nantissement.

source: Please select a Bank Account for Deposit.
es: Seleccione una cuenta bancaria para el depósito.
fr_ca: Veuillez sélectionner un compte bancaire pour le dépôt.

source: Please select a bank account for payment.
es: Por favor, seleccione una cuenta bancaria para el pago.
fr_ca: Veuillez sélectionner un compte bancaire pour le paiement.

source: Please select a bank account for payout.
es: Por favor, seleccione una cuenta bancaria para el pago.
fr_ca: Veuillez sélectionner un compte bancaire pour le paiement.

source: Please select a Color.
es: Por favor, seleccione un color.
fr_ca: Veuillez sélectionner une couleur.

source: Please select a Date in the future.
es: Seleccione una fecha en el futuro.
fr_ca: Veuillez sélectionner une date ultérieure.

source: Please select a Date in the past.
es: Por favor, seleccione una fecha en el pasado.
fr_ca: Veuillez sélectionner une date antérieure.

source: Please select a Line of Credit.
es: Por favor, seleccione una línea de crédito.
fr_ca: Veuillez sélectionner une marge de crédit.

source: Please select a Make.
es: Por favor, seleccione una marca.
fr_ca: Veuillez sélectionner une marque.

source: Please Select a Manual Lookup Values.
es: Por favor, seleccione una búsqueda manual.
fr_ca: Veuillez sélectionner des valeurs de recherche manuelle.

source: Please select a Model.
es: Por favor, seleccione un modelo.
fr_ca: Veuillez sélectionner un modèle.

source: Please select a schedule date.
es: Por favor, seleccione una fecha programada.
fr_ca: Veuillez sélectionner une date programmée.

source: Please select a security question to answer.
es: Por favor, seleccione una pregunta de seguridad.
fr_ca: Veuillez sélectionner une question de sécurité à laquelle répondre.

source: Please select a Style.
es: Por favor, seleccione un estilo.
fr_ca: Veuillez sélectionner un style.

source: Please select a valid banking date no earlier than tomorrow and no later than the payment due date.
es: Por favor, seleccione una fecha bancaria válida que no sea antes de mañana ni después de la fecha de vencimiento del pago.
fr_ca: Veuillez sélectionner une date d'opération bancaire valide située entre demain et la date d'échéance du paiement.

source: Please select a Valid Date.
es: Por favor, seleccione una fecha válida.
fr_ca: Veuillez sélectionner une date valide.

source: Please select a Valid End Date.
es: Por favor, seleccione una fecha de terminación válida.
fr_ca: Veuillez sélectionner une date d'échéance valide.

source: Please select a Valid Start Date.
es: Por favor, seleccione una fecha de inicio válida.
fr_ca: Veuillez sélectionner une date de début valide.

source: Please select a Year.
es: Por favor, seleccione un año.
fr_ca: Veuillez sélectionner une année.

source: Please select an Inventory Location.
es: Por favor, seleccione una ubicación de inventario.
fr_ca: Veuillez sélectionner un emplacement d'inventaire.

source: Please select either "Temporary" or "Permanent".
es: Por favor, seleccione "temporal" o "permanente".
fr_ca: Veuillez sélectionner « Temporaire » ou « Permanent ».

source: Please select past End Date.
es: Seleccione una fecha final pasada.
fr_ca: Veuillez sélectionner une date d'échéance antérieure.

source: Please select who has the title.
es: Por favor, seleccione quién tiene el título.
fr_ca: Veuillez sélectionner qui est en possession du certificat d'immatriculation.

source: Please select who to pay.
fr_ca: Veuillez sélectionner une modalité de paiement.

source: Please try a new search
fr_ca: Veuillez tenter une nouvelle recherche.

source: Please upload your floor plan documentaion.
fr_ca: Veuillez télécharger vos documents du plan de nantissement.

source: Please upload your floor plan documents.
es: Cargue los documentos de su plan de piso.
fr_ca: Veuillez télécharger vos documents du plan de nantissement.

source: Posted
es: Publicado
fr_ca: Publié
