Repository: gmadala/DP
Catalog: po/*.po
Languages: es, fr_ca

source: Your documents were uploaded successfully.
es: Sus documentos se cargaron correctamente.
fr_ca: Vos documents ont été téléchargés avec succès.

source: Your flooring request has been submitted to NextGear Capital.
es: Se ha enviado su solicitud de puesta en piso a NextGear Capital.
fr_ca: Votre demande de financement a été soumise à NextGear Capital.

source: Your PIN must consist of four numbers, no letters or special characters.
es: Su NIP debe consistir de cuatro números, sin letras ni caracteres especiales.
fr_ca: Votre NIP doit contenir quatre chiffres, sans lettres ni caractères spéciaux.

source: Your purchase date is older than 365 days. Please contact Floor Plan Services at fundingservices@nextgearcapital.com.
fr_ca: Votre achat date de plus de 365 jours. Veuillez communiquer avec les Services de plan de nantissement à fundingservices@nextgearcapital.com.

source: Your request for a payout in the amount of {{ amount }} to your account "{{ bankAccountName }}" has been successfully submitted.
es: Su solicitud de pago por la cantidad de {{ amount }} a su cuenta "{{ bankAccountName }}" se ha enviado satisfactoriamente.
fr_ca: Votre demande d'un paiement au montant de {{ amount }} porté à votre compte "{{ bankAccountName }}" a été soumise avec succès.

source: Your request has been submitted. Credit requests typically take 3-5 business days to process. You will be notified as soon as your request has been processed.
es: Se ha enviado su solicitud. Las solicitudes de crédito normalmente tardan de 3 a 5 días hábiles en procesarse. Se le notificará tan pronto como se haya procesado su solicitud.
fr_ca: Votre demande a été soumise. Les demandes de crédit sont généralement traitées en 3 à 5 jours ouvrables. Vous serez avisés par courriel aussitôt que votre demande sera traitée.

source: Your session expired due to inactivity. Please log in again.
es: Su sesión terminó por inactividad, por favor, inicie otra sesión.
fr_ca: Votre session a expiré pour cause d'inactivité. Veuillez ouvrir une nouvelle session.

source: Your title request has been approved. An email will be sent to you shortly with a tracking number.
es: Se ha aprobado su solicitud de títulos, recibirá un correo electrónico en breve con el número de rastreo.
fr_ca: Votre demande de certificat d'immatriculation a été approuvée. Un courriel contenant un numéro de suivi vous sera envoyé sous peu.

source: Your title request has been submitted.
es: Se ha enviado su solicitud de títulos.
fr_ca: Votre demande de certificat d'immatriculation a été soumise.

source: Your title request(s) can not be processed at this time.
es: Su(s) solicitud(es) de títulos no pueden procesarse en este momento.
fr_ca: Vos demandes de certificats d'immatriculation ne peuvent être traitées en ce moment.

source: Your Top 10 Auctions
es: Sus 10 subastas principales
fr_ca: Vos 10 meilleurs encans

source: Your Top Auctions
es: Sus subastas principales
fr_ca: Vos meilleurs encans

source: Your Top Auctions is a list of auctions and dealers that you have purchased at least two vehicles from in the past 12 months. For each auction, a breakdown is given which allows you to analyze which auctions or sellers are providing you with the best value on vehicle purchases.
es: Sus Subastas Principales es una lista de subastas y distribuidores a los que les haya comprado por lo menos dos vehículos en los últimos 12 meses. Se proporciona el desglose de cada subasta y éste le permitirá analizar qué subastas o vendedores le están proporcionando el mejor valor en la compra de vehículos.
fr_ca: « Vos meilleurs encans » contient une liste des encans et des concessionnaires auprès desquels vous avez acheté au moins deux véhicules au cours des 12 derniers mois. Pour chaque encan, une ventilation vous permet d'analyser quels encans ou quels vendeurs vous offrent la meilleure valeur sur les achats de véhicules.

source: Zip
es: Código postal
fr_ca: Code Postal

source: Zip Code
es: Código postal
fr_ca: Code postal

source: - OR -
es: - O -

source: {{ selectedReceipts.length }} <span class="lockup-minor heavy">out of</span> 20
es: {{ selectedReceipts.length }} <span class="lockup-minor heavy">de</span> 20

source: Actions
es: Acciones

source: Claim Form
es: Formulario de reclamación

source: Close
es: Cerrar

source: Close Details
es: Cerrar detalles

source: Collateral Protection Program
es: Programa de protección de garantía

source: Credits and Payments
es: Créditos y pagos

source: Date
es: Fecha

source: Dates
es: Fechas

source: Dealer Funding Checklist
es: Lista de Verificación de Financiamiento a Proveedores

source: Default Deposit Account:
es: Cuenta predeterminada para depósitos:

source: Default Payment Account:
es: Cuenta predeterminada para pagos:

source: Description
es: Descripción

source: Documents
es: Documentos

source: Download myNextGear mobile Android
es: Descargue myNextGear mobile para Android

source: Download myNextGear mobile iOS
es: Descargue myNextGear mobile para iOS

source: Excellent
es: Excelente

source: Fill out for Kelley Blue Book<sup>®</sup> Auction Values
es: Ingrese para obtener los valores de subasta de Kelley Blue Book<sup>®</sup>

source: Guidelines
es: Lineamientos

source: Information Sheet
es: Hoja de información

source: Initiate your request for a permanent or temporary increase to your current line of credit.
es: Inicie su solicitud de un aumento permanente o provisional de su línea de crédito.

source: Instructions for Buyers
es: Instrucciones para compradores

source: Instructions for Sellers
es: Instrucciones para vendedores

source: Manage your business with NextGear Capital on the go.
es: Maneje su negocio con NextGear Capital en cualquier parte

source: Manual Lookup
es: Búsqueda manual

source: Mobile Apps
es: Aplicaciones móviles

source: NextGear Capital Documents
es: Documentos de NextGear Capital

source: Notifications
es: Notificaciones

source: OK
es: De acuerdo

source: Permanent
es: Permanente

source: Please enter a value less than $1,000,000,000,000.
es: Por favor, ingrese un valor menor a $1,000,000,000,000.

source: Rates and Fees
es: Tasas y cargos

source: Recent Transaction
es: Transacción reciente

source: Reset Values
es: Restaure los valores

source: Scheduled payments are not made until the scheduled date. <br> Interest and/or fees may continue to accrue between now and your scheduled payment date.
es: Los pagos programados no se realizan antes de la fecha programada. <br> Los intereses y/o cargos pueden continuar acumulándose entre hoy y su fecha de pago programada.

source: Self-Service Links
es: Vínculos de auto servicio

source: Show Details
es: Ver detalles

source: Sorry, no results found. Please <a ng-click="floorplanData.resetSearch()" title="New Search">try a new search</a>.
es: Lo sentimos, no encontramos ningún resultado. Por favor, <a ng-click="floorplanData.resetSearch()" title="New Search">realice una nueva búsqueda</a>.

source: Style
es: Estilo

source: Terms and Conditions
es: Términos y condiciones

source: The new menu is redesigned for both mobile and web view so all of your selections are available in one place.
es: El nuevo menú se ha rediseñado para visualizarse en dispositivos móviles y en la web, para que todas sus selecciones estén disponibles en un solo lugar.

source: Title Management Frequently Asked Questions
es: Preguntas frecuentes sobre el manejo del Título de propiedad

source: Title Requested
es: Título solicitado

source: Video Walkthrough
es: Explicación en video

source: View Receipts
es: Ver recibos

source: VIN Lookup
es: Búsqueda ViN

source: We're sorry, the highlighted title(s) listed above cannot be processed at this time. Please call Customer Service at <span class="highlight"><nxg-dealer-customer-support-phone></nxg-dealer-customer-support-phone></span>
es: Lo sentimos, el (los) título(s) resaltado(s) en la lista de arriba no puede(n) procesarse en este momento. Por favor, llame a Servicio a Clientes a: <span class="highlight"><nxg-dealer-customer-support-phone></nxg-dealer-customer-support-phone></span>

source: Welcome Letter
es: Carta de Bienvenida

source: Welcome Packet
es: Paquete de Bienvenida

source: Your Payments Have Been Submitted.
es: Se han enviado sus pagos.
